ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define ADC0CN_ADINT__BMASK           0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT           0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET         0x00 ///< ADC0 has not completed a conversion since the last
                                           ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET             0x20 ///< ADC0 completed a data conversion.                 
                                                                                                  
#define ADC0CN_ADBMEN__BMASK          0x40 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__SHIFT          0x06 ///< Burst Mode Enable                                 
#define ADC0CN_ADBMEN__BURST_DISABLED 0x00 ///< ADC0 Burst Mode Disabled.                         
#define ADC0CN_ADBMEN__BURST_ENABLED  0x40 ///< ADC0 Burst Mode Enabled.                          
                                                                                                  
#define ADC0CN_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                           ///< conversions).                                     
                                                                                                  
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xD3)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xD2)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xD4)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK  0x1F ///< ADC0 Positive Input Selection 
#define ADC0MX_ADC0MX__SHIFT  0x00 ///< ADC0 Positive Input Selection 
#define ADC0MX_ADC0MX__ADC0P0 0x00 ///< Select channel ADC0.0.        
#define ADC0MX_ADC0MX__TEMP   0x1B ///< Temperature Sensor.           
#define ADC0MX_ADC0MX__VDD    0x1C ///< VDD Supply Voltage.           
#define ADC0MX_ADC0MX__LDO    0x1D ///< Internal LDO regulator output.
#define ADC0MX_ADC0MX__GND    0x1F ///< Ground.                       
                                                                      
//------------------------------------------------------------------------------
// ADC0PWR Enums (ADC0 Power Control @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0PWR_ADPWR__FMASK              0x0F ///< Burst Mode Power Up Time                         
#define ADC0PWR_ADPWR__SHIFT              0x00 ///< Burst Mode Power Up Time                         
                                                                                                     
#define ADC0PWR_ADLPM__BMASK              0x80 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__SHIFT              0x07 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__LOW_POWER_DISABLED 0x00 ///< Disable low power mode.                          
#define ADC0PWR_ADLPM__LOW_POWER_ENABLED  0x80 ///< Enable low power mode (requires extended tracking
                                               ///< time).                                           
                                                                                                     
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK 0x3F ///< Burst Mode Tracking Time
#define ADC0TK_ADTK__SHIFT 0x00 ///< Burst Mode Tracking Time
                                                             
//------------------------------------------------------------------------------
// AMUX0P0 Enums (Port 0 Analog Multiplexer Control @ 0x9A)
//------------------------------------------------------------------------------
#define AMUX0P0_B0__BMASK         0x01 ///< Port 0 Bit 0 Analog Multiplexor Control        
#define AMUX0P0_B0__SHIFT         0x00 ///< Port 0 Bit 0 Analog Multiplexor Control        
#define AMUX0P0_B0__NOT_CONNECTED 0x00 ///< P0.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B0__CONNECTED     0x01 ///< P0.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B1__BMASK         0x02 ///< Port 0 Bit 1 Analog Multiplexor Control        
#define AMUX0P0_B1__SHIFT         0x01 ///< Port 0 Bit 1 Analog Multiplexor Control        
#define AMUX0P0_B1__NOT_CONNECTED 0x00 ///< P0.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B1__CONNECTED     0x02 ///< P0.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B2__BMASK         0x04 ///< Port 0 Bit 2 Analog Multiplexor Control        
#define AMUX0P0_B2__SHIFT         0x02 ///< Port 0 Bit 2 Analog Multiplexor Control        
#define AMUX0P0_B2__NOT_CONNECTED 0x00 ///< P0.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B2__CONNECTED     0x04 ///< P0.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B3__BMASK         0x08 ///< Port 0 Bit 3 Analog Multiplexor Control        
#define AMUX0P0_B3__SHIFT         0x03 ///< Port 0 Bit 3 Analog Multiplexor Control        
#define AMUX0P0_B3__NOT_CONNECTED 0x00 ///< P0.3 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B3__CONNECTED     0x08 ///< P0.3 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B4__BMASK         0x10 ///< Port 0 Bit 4 Analog Multiplexor Control        
#define AMUX0P0_B4__SHIFT         0x04 ///< Port 0 Bit 4 Analog Multiplexor Control        
#define AMUX0P0_B4__NOT_CONNECTED 0x00 ///< P0.4 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B4__CONNECTED     0x10 ///< P0.4 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B5__BMASK         0x20 ///< Port 0 Bit 5 Analog Multiplexor Control        
#define AMUX0P0_B5__SHIFT         0x05 ///< Port 0 Bit 5 Analog Multiplexor Control        
#define AMUX0P0_B5__NOT_CONNECTED 0x00 ///< P0.5 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B5__CONNECTED     0x20 ///< P0.5 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B6__BMASK         0x40 ///< Port 0 Bit 6 Analog Multiplexor Control        
#define AMUX0P0_B6__SHIFT         0x06 ///< Port 0 Bit 6 Analog Multiplexor Control        
#define AMUX0P0_B6__NOT_CONNECTED 0x00 ///< P0.6 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B6__CONNECTED     0x40 ///< P0.6 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P0_B7__BMASK         0x80 ///< Port 0 Bit 7 Analog Multiplexor Control        
#define AMUX0P0_B7__SHIFT         0x07 ///< Port 0 Bit 7 Analog Multiplexor Control        
#define AMUX0P0_B7__NOT_CONNECTED 0x00 ///< P0.7 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P0_B7__CONNECTED     0x80 ///< P0.7 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// AMUX0P1 Enums (Port 1 Analog Multiplexer Control @ 0x9B)
//------------------------------------------------------------------------------
#define AMUX0P1_B0__BMASK         0x01 ///< Port 1 Bit 0 Analog Multiplexor Control        
#define AMUX0P1_B0__SHIFT         0x00 ///< Port 1 Bit 0 Analog Multiplexor Control        
#define AMUX0P1_B0__NOT_CONNECTED 0x00 ///< P1.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B0__CONNECTED     0x01 ///< P1.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B1__BMASK         0x02 ///< Port 1 Bit 1 Analog Multiplexor Control        
#define AMUX0P1_B1__SHIFT         0x01 ///< Port 1 Bit 1 Analog Multiplexor Control        
#define AMUX0P1_B1__NOT_CONNECTED 0x00 ///< P1.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B1__CONNECTED     0x02 ///< P1.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
