ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define AMUX0P1_B2__BMASK         0x04 ///< Port 1 Bit 2 Analog Multiplexor Control        
#define AMUX0P1_B2__SHIFT         0x02 ///< Port 1 Bit 2 Analog Multiplexor Control        
#define AMUX0P1_B2__NOT_CONNECTED 0x00 ///< P1.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B2__CONNECTED     0x04 ///< P1.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B3__BMASK         0x08 ///< Port 1 Bit 3 Analog Multiplexor Control        
#define AMUX0P1_B3__SHIFT         0x03 ///< Port 1 Bit 3 Analog Multiplexor Control        
#define AMUX0P1_B3__NOT_CONNECTED 0x00 ///< P1.3 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B3__CONNECTED     0x08 ///< P1.3 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B4__BMASK         0x10 ///< Port 1 Bit 4 Analog Multiplexor Control        
#define AMUX0P1_B4__SHIFT         0x04 ///< Port 1 Bit 4 Analog Multiplexor Control        
#define AMUX0P1_B4__NOT_CONNECTED 0x00 ///< P1.4 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B4__CONNECTED     0x10 ///< P1.4 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B5__BMASK         0x20 ///< Port 1 Bit 5 Analog Multiplexor Control        
#define AMUX0P1_B5__SHIFT         0x05 ///< Port 1 Bit 5 Analog Multiplexor Control        
#define AMUX0P1_B5__NOT_CONNECTED 0x00 ///< P1.5 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B5__CONNECTED     0x20 ///< P1.5 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B6__BMASK         0x40 ///< Port 1 Bit 6 Analog Multiplexor Control        
#define AMUX0P1_B6__SHIFT         0x06 ///< Port 1 Bit 6 Analog Multiplexor Control        
#define AMUX0P1_B6__NOT_CONNECTED 0x00 ///< P1.6 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B6__CONNECTED     0x40 ///< P1.6 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P1_B7__BMASK         0x80 ///< Port 1 Bit 7 Analog Multiplexor Control        
#define AMUX0P1_B7__SHIFT         0x07 ///< Port 1 Bit 7 Analog Multiplexor Control        
#define AMUX0P1_B7__NOT_CONNECTED 0x00 ///< P1.7 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P1_B7__CONNECTED     0x80 ///< P1.7 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// AMUX0P2 Enums (Port 2 Analog Multiplexer Control @ 0x9C)
//------------------------------------------------------------------------------
#define AMUX0P2_B0__BMASK         0x01 ///< Port 2 Bit 0 Analog Multiplexor Control        
#define AMUX0P2_B0__SHIFT         0x00 ///< Port 2 Bit 0 Analog Multiplexor Control        
#define AMUX0P2_B0__NOT_CONNECTED 0x00 ///< P2.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B0__CONNECTED     0x01 ///< P2.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B1__BMASK         0x02 ///< Port 2 Bit 1 Analog Multiplexor Control        
#define AMUX0P2_B1__SHIFT         0x01 ///< Port 2 Bit 1 Analog Multiplexor Control        
#define AMUX0P2_B1__NOT_CONNECTED 0x00 ///< P2.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B1__CONNECTED     0x02 ///< P2.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B2__BMASK         0x04 ///< Port 2 Bit 2 Analog Multiplexor Control        
#define AMUX0P2_B2__SHIFT         0x02 ///< Port 2 Bit 2 Analog Multiplexor Control        
#define AMUX0P2_B2__NOT_CONNECTED 0x00 ///< P2.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B2__CONNECTED     0x04 ///< P2.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B3__BMASK         0x08 ///< Port 2 Bit 3 Analog Multiplexor Control        
#define AMUX0P2_B3__SHIFT         0x03 ///< Port 2 Bit 3 Analog Multiplexor Control        
#define AMUX0P2_B3__NOT_CONNECTED 0x00 ///< P2.3 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B3__CONNECTED     0x08 ///< P2.3 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B4__BMASK         0x10 ///< Port 2 Bit 4 Analog Multiplexor Control        
#define AMUX0P2_B4__SHIFT         0x04 ///< Port 2 Bit 4 Analog Multiplexor Control        
#define AMUX0P2_B4__NOT_CONNECTED 0x00 ///< P2.4 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B4__CONNECTED     0x10 ///< P2.4 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B5__BMASK         0x20 ///< Port 2 Bit 5 Analog Multiplexor Control        
#define AMUX0P2_B5__SHIFT         0x05 ///< Port 2 Bit 5 Analog Multiplexor Control        
#define AMUX0P2_B5__NOT_CONNECTED 0x00 ///< P2.5 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B5__CONNECTED     0x20 ///< P2.5 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B6__BMASK         0x40 ///< Port 2 Bit 6 Analog Multiplexor Control        
#define AMUX0P2_B6__SHIFT         0x06 ///< Port 2 Bit 6 Analog Multiplexor Control        
#define AMUX0P2_B6__NOT_CONNECTED 0x00 ///< P2.6 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B6__CONNECTED     0x40 ///< P2.6 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P2_B7__BMASK         0x80 ///< Port 2 Bit 7 Analog Multiplexor Control        
#define AMUX0P2_B7__SHIFT         0x07 ///< Port 2 Bit 7 Analog Multiplexor Control        
#define AMUX0P2_B7__NOT_CONNECTED 0x00 ///< P2.7 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P2_B7__CONNECTED     0x80 ///< P2.7 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// AMUX0P3 Enums (Port 3 Analog Multiplexer Control @ 0xA4)
//------------------------------------------------------------------------------
#define AMUX0P3_B0__BMASK         0x01 ///< Port 3 Bit 0 Analog Multiplexor Control        
#define AMUX0P3_B0__SHIFT         0x00 ///< Port 3 Bit 0 Analog Multiplexor Control        
#define AMUX0P3_B0__NOT_CONNECTED 0x00 ///< P3.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B0__CONNECTED     0x01 ///< P3.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
