ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define AMUX0P3_B1__BMASK         0x02 ///< Port 3 Bit 1 Analog Multiplexor Control        
#define AMUX0P3_B1__SHIFT         0x01 ///< Port 3 Bit 1 Analog Multiplexor Control        
#define AMUX0P3_B1__NOT_CONNECTED 0x00 ///< P3.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B1__CONNECTED     0x02 ///< P3.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B2__BMASK         0x04 ///< Port 3 Bit 2 Analog Multiplexor Control        
#define AMUX0P3_B2__SHIFT         0x02 ///< Port 3 Bit 2 Analog Multiplexor Control        
#define AMUX0P3_B2__NOT_CONNECTED 0x00 ///< P3.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B2__CONNECTED     0x04 ///< P3.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B3__BMASK         0x08 ///< Port 3 Bit 3 Analog Multiplexor Control        
#define AMUX0P3_B3__SHIFT         0x03 ///< Port 3 Bit 3 Analog Multiplexor Control        
#define AMUX0P3_B3__NOT_CONNECTED 0x00 ///< P3.3 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B3__CONNECTED     0x08 ///< P3.3 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B4__BMASK         0x10 ///< Port 3 Bit 4 Analog Multiplexor Control        
#define AMUX0P3_B4__SHIFT         0x04 ///< Port 3 Bit 4 Analog Multiplexor Control        
#define AMUX0P3_B4__NOT_CONNECTED 0x00 ///< P3.4 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B4__CONNECTED     0x10 ///< P3.4 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B5__BMASK         0x20 ///< Port 3 Bit 5 Analog Multiplexor Control        
#define AMUX0P3_B5__SHIFT         0x05 ///< Port 3 Bit 5 Analog Multiplexor Control        
#define AMUX0P3_B5__NOT_CONNECTED 0x00 ///< P3.5 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B5__CONNECTED     0x20 ///< P3.5 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B6__BMASK         0x40 ///< Port 3 Bit 6 Analog Multiplexor Control        
#define AMUX0P3_B6__SHIFT         0x06 ///< Port 3 Bit 6 Analog Multiplexor Control        
#define AMUX0P3_B6__NOT_CONNECTED 0x00 ///< P3.6 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B6__CONNECTED     0x40 ///< P3.6 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P3_B7__BMASK         0x80 ///< Port 3 Bit 7 Analog Multiplexor Control        
#define AMUX0P3_B7__SHIFT         0x07 ///< Port 3 Bit 7 Analog Multiplexor Control        
#define AMUX0P3_B7__NOT_CONNECTED 0x00 ///< P3.7 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P3_B7__CONNECTED     0x80 ///< P3.7 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// AMUX0P4 Enums (Port 4 Analog Multiplexer Control @ 0xA5)
//------------------------------------------------------------------------------
#define AMUX0P4_B0__BMASK         0x01 ///< Port 4 Bit 0 Analog Multiplexor Control        
#define AMUX0P4_B0__SHIFT         0x00 ///< Port 4 Bit 0 Analog Multiplexor Control        
#define AMUX0P4_B0__NOT_CONNECTED 0x00 ///< P4.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B0__CONNECTED     0x01 ///< P4.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B1__BMASK         0x02 ///< Port 4 Bit 1 Analog Multiplexor Control        
#define AMUX0P4_B1__SHIFT         0x01 ///< Port 4 Bit 1 Analog Multiplexor Control        
#define AMUX0P4_B1__NOT_CONNECTED 0x00 ///< P4.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B1__CONNECTED     0x02 ///< P4.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
