ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define AMUX0P4_B2__BMASK         0x04 ///< Port 4 Bit 2 Analog Multiplexor Control        
#define AMUX0P4_B2__SHIFT         0x02 ///< Port 4 Bit 2 Analog Multiplexor Control        
#define AMUX0P4_B2__NOT_CONNECTED 0x00 ///< P4.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B2__CONNECTED     0x04 ///< P4.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B3__BMASK         0x08 ///< Port 4 Bit 3 Analog Multiplexor Control        
#define AMUX0P4_B3__SHIFT         0x03 ///< Port 4 Bit 3 Analog Multiplexor Control        
#define AMUX0P4_B3__NOT_CONNECTED 0x00 ///< P4.3 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B3__CONNECTED     0x08 ///< P4.3 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B4__BMASK         0x10 ///< Port 4 Bit 4 Analog Multiplexor Control        
#define AMUX0P4_B4__SHIFT         0x04 ///< Port 4 Bit 4 Analog Multiplexor Control        
#define AMUX0P4_B4__NOT_CONNECTED 0x00 ///< P4.4 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B4__CONNECTED     0x10 ///< P4.4 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B5__BMASK         0x20 ///< Port 4 Bit 5 Analog Multiplexor Control        
#define AMUX0P4_B5__SHIFT         0x05 ///< Port 4 Bit 5 Analog Multiplexor Control        
#define AMUX0P4_B5__NOT_CONNECTED 0x00 ///< P4.5 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B5__CONNECTED     0x20 ///< P4.5 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B6__BMASK         0x40 ///< Port 4 Bit 6 Analog Multiplexor Control        
#define AMUX0P4_B6__SHIFT         0x06 ///< Port 4 Bit 6 Analog Multiplexor Control        
#define AMUX0P4_B6__NOT_CONNECTED 0x00 ///< P4.6 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B6__CONNECTED     0x40 ///< P4.6 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P4_B7__BMASK         0x80 ///< Port 4 Bit 7 Analog Multiplexor Control        
#define AMUX0P4_B7__SHIFT         0x07 ///< Port 4 Bit 7 Analog Multiplexor Control        
#define AMUX0P4_B7__NOT_CONNECTED 0x00 ///< P4.7 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P4_B7__CONNECTED     0x80 ///< P4.7 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// AMUX0P5 Enums (Port 5 Analog Multiplexer Control @ 0xA6)
//------------------------------------------------------------------------------
#define AMUX0P5_B0__BMASK         0x01 ///< Port 5 Bit 0 Analog Multiplexor Control        
#define AMUX0P5_B0__SHIFT         0x00 ///< Port 5 Bit 0 Analog Multiplexor Control        
#define AMUX0P5_B0__NOT_CONNECTED 0x00 ///< P5.0 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P5_B0__CONNECTED     0x01 ///< P5.0 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P5_B1__BMASK         0x02 ///< Port 5 Bit 1 Analog Multiplexor Control        
#define AMUX0P5_B1__SHIFT         0x01 ///< Port 5 Bit 1 Analog Multiplexor Control        
#define AMUX0P5_B1__NOT_CONNECTED 0x00 ///< P5.1 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P5_B1__CONNECTED     0x02 ///< P5.1 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
#define AMUX0P5_B2__BMASK         0x04 ///< Port 5 Bit 2 Analog Multiplexor Control        
#define AMUX0P5_B2__SHIFT         0x02 ///< Port 5 Bit 2 Analog Multiplexor Control        
#define AMUX0P5_B2__NOT_CONNECTED 0x00 ///< P5.2 pin is not connected by the Analog        
                                       ///< Multiplexer for CS0 or ADC0 measurements.      
#define AMUX0P5_B2__CONNECTED     0x04 ///< P5.2 pin is connected by the Analog Multiplexer
                                       ///< for CS0 or ADC0 measurements.                  
                                                                                           
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
