ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define CLKSEL_CLKRDY__BMASK          0x80 ///< System Clock Divider Clock Ready Flag             
#define CLKSEL_CLKRDY__SHIFT          0x07 ///< System Clock Divider Clock Ready Flag             
#define CLKSEL_CLKRDY__NOT_SET        0x00 ///< The selected clock divide setting has not been    
                                           ///< applied to the system clock.                      
#define CLKSEL_CLKRDY__SET            0x80 ///< The selected clock divide setting has been applied
                                           ///< to the system clock.                              
                                                                                                  
//------------------------------------------------------------------------------
// PCLKEN Enums (Low Power Peripheral Clock Enable @ 0xF6)
//------------------------------------------------------------------------------
#define PCLKEN_PCLKEN0__BMASK    0x01 ///< Low Power Idle Mode Peripheral Set 0 Enable       
#define PCLKEN_PCLKEN0__SHIFT    0x00 ///< Low Power Idle Mode Peripheral Set 0 Enable       
#define PCLKEN_PCLKEN0__DISABLED 0x00 ///< Disable clocks of UART0, Timer 3, SPI0, and I2C0  
                                      ///< in low power idle mode.                           
#define PCLKEN_PCLKEN0__ENABLED  0x01 ///< Enable clocks of UART0, Timer 3, SPI0, and I2C0 in
                                      ///< low power idle mode.                              
                                                                                             
#define PCLKEN_PCLKEN1__BMASK    0x02 ///< Low Power Idle Mode Peripheral Set 1 Enable       
#define PCLKEN_PCLKEN1__SHIFT    0x01 ///< Low Power Idle Mode Peripheral Set 1 Enable       
#define PCLKEN_PCLKEN1__DISABLED 0x00 ///< Disable clocks of MAC0 in low power idle mode.    
#define PCLKEN_PCLKEN1__ENABLED  0x02 ///< Enable clocks of MAC0 in low power idle mode.     
                                                                                             
#define PCLKEN_PCLKEN2__BMASK    0x04 ///< Low Power Idle Mode Peripheral Set 2 Enable       
#define PCLKEN_PCLKEN2__SHIFT    0x02 ///< Low Power Idle Mode Peripheral Set 2 Enable       
#define PCLKEN_PCLKEN2__DISABLED 0x00 ///< Disable clocks of PCA0, CS0, and ADC0 in low power
                                      ///< idle mode.                                        
#define PCLKEN_PCLKEN2__ENABLED  0x04 ///< Enable clocks of PCA0, CS0, and ADC0 in low power 
                                      ///< idle mode.                                        
                                                                                             
#define PCLKEN_PCLKEN3__BMASK    0x08 ///< Low Power Idle Mode Peripheral Set 3 Enable       
#define PCLKEN_PCLKEN3__SHIFT    0x03 ///< Low Power Idle Mode Peripheral Set 3 Enable       
#define PCLKEN_PCLKEN3__DISABLED 0x00 ///< Disable clocks of Timer 0, 1, 2, CRC0, C2, RTC0,  
                                      ///< and Port Match in low power idle mode.            
#define PCLKEN_PCLKEN3__ENABLED  0x08 ///< Enable clocks of Timer 0, 1, 2, CRC0, C2, RTC0,   
                                      ///< and Port Match in low power idle mode.            
                                                                                             
#define PCLKEN_PCLKEN4__BMASK    0x10 ///< Low Power Active Mode Peripheral Set 0 Enable     
#define PCLKEN_PCLKEN4__SHIFT    0x04 ///< Low Power Active Mode Peripheral Set 0 Enable     
#define PCLKEN_PCLKEN4__DISABLED 0x00 ///< Disable clocks of UART0, Timer 3, SPI0, and I2C0  
                                      ///< in low power active mode.                         
#define PCLKEN_PCLKEN4__ENABLED  0x10 ///< Enable clocks of UART0, Timer 3, SPI0, and I2C0 in
                                      ///< low power active mode.                            
                                                                                             
#define PCLKEN_PCLKEN5__BMASK    0x20 ///< Low Power Active Mode Peripheral Set 1 Enable     
#define PCLKEN_PCLKEN5__SHIFT    0x05 ///< Low Power Active Mode Peripheral Set 1 Enable     
#define PCLKEN_PCLKEN5__DISABLED 0x00 ///< Disable clocks of MAC0 in low power active mode.  
#define PCLKEN_PCLKEN5__ENABLED  0x20 ///< Enable clocks of MAC0 in low power active mode.   
                                                                                             
#define PCLKEN_PCLKEN6__BMASK    0x40 ///< Low Power Active Mode Peripheral Set 2 Enable     
#define PCLKEN_PCLKEN6__SHIFT    0x06 ///< Low Power Active Mode Peripheral Set 2 Enable     
#define PCLKEN_PCLKEN6__DISABLED 0x00 ///< Disable clocks of PCA0, CS0, and ADC0 in low power
                                      ///< active mode.                                      
#define PCLKEN_PCLKEN6__ENABLED  0x40 ///< Enable clocks of PCA0, CS0, and ADC0 in low power 
                                      ///< active mode.                                      
                                                                                             
#define PCLKEN_PCLKEN7__BMASK    0x80 ///< Low Power Active Mode Peripheral Set 3 Enable     
#define PCLKEN_PCLKEN7__SHIFT    0x07 ///< Low Power Active Mode Peripheral Set 3 Enable     
#define PCLKEN_PCLKEN7__DISABLED 0x00 ///< Disable clocks of Timer 0, 1, 2, CRC0, C2, RTC0,  
                                      ///< and Port Match in low power active mode.          
#define PCLKEN_PCLKEN7__ENABLED  0x80 ///< Enable clocks of Timer 0, 1, 2, CRC0, C2, RTC0,   
                                      ///< and Port Match in low power active mode.          
                                                                                             
//------------------------------------------------------------------------------
// CRC0AUTO Enums (CRC0 Automatic Control @ 0x9E)
//------------------------------------------------------------------------------
#define CRC0AUTO_CRCST__FMASK     0x7F ///< Automatic CRC Calculation Starting Block  
#define CRC0AUTO_CRCST__SHIFT     0x00 ///< Automatic CRC Calculation Starting Block  
                                                                                      
#define CRC0AUTO_AUTOEN__BMASK    0x80 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__SHIFT    0x07 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__DISABLED 0x00 ///< Disable automatic CRC operations on flash.
#define CRC0AUTO_AUTOEN__ENABLED  0x80 ///< Enable automatic CRC operations on flash. 
                                                                                      
//------------------------------------------------------------------------------
// CRC0CN Enums (CRC0 Control @ 0x84)
//------------------------------------------------------------------------------
#define CRC0CN_CRCPNT__BMASK        0x01 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__ACCESS_LOWER 0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit CRC      
                                         ///< result.                                          
#define CRC0CN_CRCPNT__ACCESS_UPPER 0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit CRC     
                                         ///< result.                                          
                                                                                               
#define CRC0CN_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x0000 on write of 1 to     
                                         ///< CRCINIT.                                         
#define CRC0CN_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFF on write of 1 to     
                                         ///< CRCINIT.                                         
                                                                                               
#define CRC0CN_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                
#define CRC0CN_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased
                                         ///< on the value of CRCVAL.                          
                                                                                               
//------------------------------------------------------------------------------
// CRC0CNT Enums (CRC0 Automatic Flash Sector Count @ 0x9D)
//------------------------------------------------------------------------------
#define CRC0CNT_CRCCNT__FMASK  0x7F ///< Automatic CRC Calculation Block Count
#define CRC0CNT_CRCCNT__SHIFT  0x00 ///< Automatic CRC Calculation Block Count
                                                                              
#define CRC0CNT_CRCDN__BMASK   0x80 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__SHIFT   0x07 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__NOT_SET 0x00 ///< A CRC calculation is in progress.    
#define CRC0CNT_CRCDN__SET     0x80 ///< A CRC calculation is not in progress.
                                                                              
//------------------------------------------------------------------------------
// CRC0DAT Enums (CRC0 Data Output @ 0x86)
//------------------------------------------------------------------------------
#define CRC0DAT_CRC0DAT__FMASK 0xFF ///< CRC Data Output
#define CRC0DAT_CRC0DAT__SHIFT 0x00 ///< CRC Data Output
                                                        
//------------------------------------------------------------------------------
// CRC0FLIP Enums (CRC0 Bit Flip @ 0x9F)
//------------------------------------------------------------------------------
#define CRC0FLIP_CRC0FLIP__FMASK 0xFF ///< CRC0 Bit Flip
#define CRC0FLIP_CRC0FLIP__SHIFT 0x00 ///< CRC0 Bit Flip
                                                        
//------------------------------------------------------------------------------
// CRC0IN Enums (CRC0 Data Input @ 0x85)
//------------------------------------------------------------------------------
#define CRC0IN_CRC0IN__FMASK 0xFF ///< CRC Data Input
#define CRC0IN_CRC0IN__SHIFT 0x00 ///< CRC Data Input
                                                     
//------------------------------------------------------------------------------
// CS0CF Enums (Capacitive Sense 0 Configuration @ 0xAA)
//------------------------------------------------------------------------------
#define CS0CF_CS0ACU__FMASK               0x07 ///< CS0 Accumulator Mode Select                       
#define CS0CF_CS0ACU__SHIFT               0x00 ///< CS0 Accumulator Mode Select                       
#define CS0CF_CS0ACU__ACC_1               0x00 ///< Accumulate 1 sample.                              
#define CS0CF_CS0ACU__ACC_4               0x01 ///< Accumulate 4 samples.                             
#define CS0CF_CS0ACU__ACC_8               0x02 ///< Accumulate 8 samples.                             
#define CS0CF_CS0ACU__ACC_16              0x03 ///< Accumulate 16 samples                             
#define CS0CF_CS0ACU__ACC_32              0x04 ///< Accumulate 32 samples.                            
#define CS0CF_CS0ACU__ACC_64              0x05 ///< Accumulate 64 samples.                            
                                                                                                      
#define CS0CF_CS0MCEN__BMASK              0x08 ///< CS0 Multiple Channel Enable                       
#define CS0CF_CS0MCEN__SHIFT              0x03 ///< CS0 Multiple Channel Enable                       
#define CS0CF_CS0MCEN__MULT_CHAN_DISABLED 0x00 ///< Multiple channel feature is disabled.             
#define CS0CF_CS0MCEN__MULT_CHAN_ENABLED  0x08 ///< Channels selected by the AMUX0 registers are      
                                               ///< internally shorted together and the combined node 
                                               ///< is selected as the CS0 input. This mode can be    
                                               ///< used to detect a capacitance change on multiple   
                                               ///< channels using a single conversion.               
                                                                                                      
