ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define CS0MD2_CS0DT__FMASK           0x38 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__SHIFT           0x03 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__DISCHARGE_MODE0 0x00 ///< Discharge time is 0.75 us (recommended for most   
                                           ///< switches).                                        
#define CS0MD2_CS0DT__DISCHARGE_MODE1 0x08 ///< Discharge time is 1.0 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE2 0x10 ///< Discharge time is 1.2 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE3 0x18 ///< Discharge time is 1.5 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE4 0x20 ///< Discharge time is 2 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE5 0x28 ///< Discharge time is 3 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE6 0x30 ///< Discharge time is 6 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE7 0x38 ///< Discharge time is 12 us.                          
                                                                                                  
#define CS0MD2_CS0CR__FMASK           0xC0 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__SHIFT           0x06 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__12_BITS         0x00 ///< Conversions last 12 internal CS0 clocks and are 12
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__13_BITS         0x40 ///< Conversions last 13 internal CS0 clocks and are 13
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__14_BITS         0x80 ///< Conversions last 14 internal CS0 clocks and are 14
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__16_BITS         0xC0 ///< Conversions last 16 internal CS0 clocks.and are 16
                                           ///< bits in length.                                   
                                                                                                  
//------------------------------------------------------------------------------
// CS0MD3 Enums (Capacitive Sense 0 Mode 3 @ 0xBF)
//------------------------------------------------------------------------------
#define CS0MD3_CS0LP__FMASK      0x07 ///< CS0 Low Pass Filter Selection        
#define CS0MD3_CS0LP__SHIFT      0x00 ///< CS0 Low Pass Filter Selection        
                                                                                
#define CS0MD3_CS0RP__FMASK      0x18 ///< CS0 Ramp Selection                   
#define CS0MD3_CS0RP__SHIFT      0x03 ///< CS0 Ramp Selection                   
#define CS0MD3_CS0RP__RAMP_MODE0 0x00 ///< Ramp time is less than 1.5 us.       
#define CS0MD3_CS0RP__RAMP_MODE1 0x08 ///< Ramp time is between 1.5 us and 3 us.
#define CS0MD3_CS0RP__RAMP_MODE2 0x10 ///< Ramp time is between 3 us and 6 us.  
#define CS0MD3_CS0RP__RAMP_MODE3 0x18 ///< Ramp time is greater than 6 us.      
                                                                                
//------------------------------------------------------------------------------
// CS0MX Enums (Capacitive Sense 0 Mux Channel Select @ 0xAB)
//------------------------------------------------------------------------------
#define CS0MX_CS0MX__FMASK             0x3F ///< CS0 Mux Channel Select          
#define CS0MX_CS0MX__SHIFT             0x00 ///< CS0 Mux Channel Select          
#define CS0MX_CS0MX__CS0P0             0x00 ///< Select CS0.0.                   
#define CS0MX_CS0MX__CS0P1             0x01 ///< Select CS0.1.                   
#define CS0MX_CS0MX__CS0P2             0x02 ///< Select CS0.2.                   
#define CS0MX_CS0MX__CS0P3             0x03 ///< Select CS0.3.                   
#define CS0MX_CS0MX__CS0P4             0x04 ///< Select CS0.4.                   
#define CS0MX_CS0MX__CS0P5             0x05 ///< Select CS0.5.                   
#define CS0MX_CS0MX__CS0P6             0x06 ///< Select CS0.6.                   
#define CS0MX_CS0MX__CS0P7             0x07 ///< Select CS0.7.                   
#define CS0MX_CS0MX__CS0P8             0x08 ///< Select CS0.8.                   
#define CS0MX_CS0MX__CS0P9             0x09 ///< Select CS0.9.                   
#define CS0MX_CS0MX__CS0P10            0x0A ///< Select CS0.10.                  
#define CS0MX_CS0MX__CS0P11            0x0B ///< Select CS0.11.                  
#define CS0MX_CS0MX__CS0P12            0x0C ///< Select CS0.12.                  
#define CS0MX_CS0MX__CS0P13            0x0D ///< Select CS0.13.                  
#define CS0MX_CS0MX__CS0P14            0x0E ///< Select CS0.14.                  
#define CS0MX_CS0MX__CS0P15            0x0F ///< Select CS0.15.                  
#define CS0MX_CS0MX__CS0P16            0x10 ///< Select CS0.16.                  
#define CS0MX_CS0MX__CS0P17            0x11 ///< Select CS0.17.                  
#define CS0MX_CS0MX__CS0P18            0x12 ///< Select CS0.18.                  
#define CS0MX_CS0MX__CS0P19            0x13 ///< Select CS0.19.                  
#define CS0MX_CS0MX__CS0P20            0x14 ///< Select CS0.20.                  
#define CS0MX_CS0MX__CS0P21            0x15 ///< Select CS0.21.                  
#define CS0MX_CS0MX__CS0P22            0x16 ///< Select CS0.22.                  
#define CS0MX_CS0MX__CS0P23            0x17 ///< Select CS0.23.                  
#define CS0MX_CS0MX__CS0P24            0x18 ///< Select CS0.24.                  
#define CS0MX_CS0MX__CS0P25            0x19 ///< Select CS0.25.                  
#define CS0MX_CS0MX__CS0P26            0x1A ///< Select CS0.26.                  
#define CS0MX_CS0MX__CS0P27            0x1B ///< Select CS0.27.                  
#define CS0MX_CS0MX__CS0P28            0x1C ///< Select CS0.28.                  
#define CS0MX_CS0MX__CS0P29            0x1D ///< Select CS0.29.                  
#define CS0MX_CS0MX__CS0P30            0x1E ///< Select CS0.30.                  
#define CS0MX_CS0MX__CS0P31            0x1F ///< Select CS0.31.                  
#define CS0MX_CS0MX__CS0P32            0x20 ///< Select CS0.32.                  
#define CS0MX_CS0MX__CS0P33            0x21 ///< Select CS0.33.                  
#define CS0MX_CS0MX__CS0P34            0x22 ///< Select CS0.34.                  
#define CS0MX_CS0MX__CS0P35            0x23 ///< Select CS0.35.                  
#define CS0MX_CS0MX__CS0P36            0x24 ///< Select CS0.36.                  
#define CS0MX_CS0MX__CS0P37            0x25 ///< Select CS0.37.                  
#define CS0MX_CS0MX__CS0P38            0x26 ///< Select CS0.38.                  
#define CS0MX_CS0MX__CS0P39            0x27 ///< Select CS0.39.                  
#define CS0MX_CS0MX__CS0P40            0x28 ///< Select CS0.40.                  
#define CS0MX_CS0MX__CS0P41            0x29 ///< Select CS0.41.                  
#define CS0MX_CS0MX__CS0P42            0x2A ///< Select CS0.42.                  
                                                                                 
#define CS0MX_CS0UC__BMASK             0x80 ///< CS0 Connect                     
#define CS0MX_CS0UC__SHIFT             0x07 ///< CS0 Connect                     
#define CS0MX_CS0UC__PINS_CONNECTED    0x00 ///< CS0 connected to port pins.     
#define CS0MX_CS0UC__PINS_DISCONNECTED 0x80 ///< CS0 disconnected from port pins.
                                                                                 
//------------------------------------------------------------------------------
// CS0PM Enums (Capacitive Sense 0 Pin Monitor @ 0x96)
//------------------------------------------------------------------------------
#define CS0PM_CSPMMD__FMASK                 0x03 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__SHIFT                 0x00 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__ALWAYS_RETRY          0x00 ///< Always retry bit cycles on a pin state change.   
#define CS0PM_CSPMMD__RETRY_TWO_TIMES       0x01 ///< Retry up to twice on consecutive bit cycles.     
#define CS0PM_CSPMMD__RETRY_FOUR_TIMES      0x02 ///< Retry up to four times on consecutive bit cycles.
                                                                                                       
#define CS0PM_I2C0PM__BMASK                 0x04 ///< I2C Slave Pin Monitor Enable                     
#define CS0PM_I2C0PM__SHIFT                 0x02 ///< I2C Slave Pin Monitor Enable                     
#define CS0PM_I2C0PM__PORT_MONITOR_DISABLED 0x00 ///< Disable monitoring of the I2C Slave output pin.  
#define CS0PM_I2C0PM__PORT_MONITOR_ENABLED  0x04 ///< Enable monitoring of the I2C Slave output pin.   
                                                                                                       
#define CS0PM_PIOPM__BMASK                  0x08 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__SHIFT                  0x03 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__PORT_MONITOR_DISABLED  0x00 ///< Disable monitoring of writes to the port latches.
#define CS0PM_PIOPM__PORT_MONITOR_ENABLED   0x08 ///< Enable monitoring of writes to the port latches. 
                                                                                                       
#define CS0PM_PCAPM__BMASK                  0x10 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__SHIFT                  0x04 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__PCA_MONITOR_DISABLED   0x00 ///< Disable monitoring on the PCA output pins.       
#define CS0PM_PCAPM__PCA_MONITOR_ENABLED    0x10 ///< Enable monitoring on the PCA output pins.        
                                                                                                       
#define CS0PM_SMBPM__BMASK                  0x20 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SHIFT                  0x05 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SMBUS_MONITOR_DISABLED 0x00 ///< Disable monitoring on the SMBus pins.            
#define CS0PM_SMBPM__SMBUS_MONITOR_ENABLED  0x20 ///< Enable monitoring on the SMBus pins.             
                                                                                                       
#define CS0PM_SPIPM__BMASK                  0x40 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SHIFT                  0x06 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SPI_MONITOR_DISABLED   0x00 ///< Disable monitoring on the SPI output pins.       
#define CS0PM_SPIPM__SPI_MONITOR_ENABLED    0x40 ///< Enable monitoring on the SPI output pins.        
                                                                                                       
#define CS0PM_UAPM__BMASK                   0x80 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__SHIFT                   0x07 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__UART_MONITOR_DISABLED   0x00 ///< Disable monitoring on the UART TX pin.           
#define CS0PM_UAPM__UART_MONITOR_ENABLED    0x80 ///< Enable monitoring on the UART TX pin.            
                                                                                                       
//------------------------------------------------------------------------------
// CS0SE Enums (Capacitive Sense 0 Auto Scan End Channel @ 0xDE)
//------------------------------------------------------------------------------
#define CS0SE_CS0SE__FMASK 0x3F ///< Ending Channel for Auto Scan
#define CS0SE_CS0SE__SHIFT 0x00 ///< Ending Channel for Auto Scan
                                                                 
//------------------------------------------------------------------------------
// CS0SS Enums (Capacitive Sense 0 Auto Scan Start Channel @ 0xDD)
//------------------------------------------------------------------------------
#define CS0SS_CS0SS__FMASK 0x3F ///< Starting Channel for Auto Scan
#define CS0SS_CS0SS__SHIFT 0x00 ///< Starting Channel for Auto Scan
                                                                   
//------------------------------------------------------------------------------
// CS0THH Enums (Capacitive Sense 0 Comparator Threshold High Byte @ 0xFE)
//------------------------------------------------------------------------------
#define CS0THH_CS0THH__FMASK 0xFF ///< CS0 Comparator Threshold High Byte
#define CS0THH_CS0THH__SHIFT 0x00 ///< CS0 Comparator Threshold High Byte
                                                                         
//------------------------------------------------------------------------------
// CS0THL Enums (Capacitive Sense 0 Comparator Threshold Low Byte @ 0xFD)
//------------------------------------------------------------------------------
#define CS0THL_CS0THL__FMASK 0xFF ///< CS0 Comparator Threshold Low Byte
#define CS0THL_CS0THL__SHIFT 0x00 ///< CS0 Comparator Threshold Low Byte
                                                                        
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xE1)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xE2)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x01 ///< Revision A 
                                                
//------------------------------------------------------------------------------
// DMA0BUSY Enums (DMA0 Busy @ 0x91)
//------------------------------------------------------------------------------
#define DMA0BUSY_CH0BUSY__BMASK   0x01 ///< Channel 0 Busy                                    
#define DMA0BUSY_CH0BUSY__SHIFT   0x00 ///< Channel 0 Busy                                    
#define DMA0BUSY_CH0BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 0.               
#define DMA0BUSY_CH0BUSY__SET     0x01 ///< DMA0 transfer is in progress on channel 0 or force
                                       ///< a DMA0 transfer to start on channel 0.            
                                                                                              
#define DMA0BUSY_CH1BUSY__BMASK   0x02 ///< Channel 1 Busy                                    
#define DMA0BUSY_CH1BUSY__SHIFT   0x01 ///< Channel 1 Busy                                    
#define DMA0BUSY_CH1BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 1.               
#define DMA0BUSY_CH1BUSY__SET     0x02 ///< DMA0 transfer is in progress on channel 1 or force
                                       ///< a DMA0 transfer to start on channel 1.            
                                                                                              
#define DMA0BUSY_CH2BUSY__BMASK   0x04 ///< Channel 2 Busy                                    
#define DMA0BUSY_CH2BUSY__SHIFT   0x02 ///< Channel 2 Busy                                    
#define DMA0BUSY_CH2BUSY__NOT_SET 0x00 ///< DMA0 transfer is complete or no DMA0 transfer is  
                                       ///< currently in progress on channel 2.               
#define DMA0BUSY_CH2BUSY__SET     0x04 ///< DMA0 transfer is in progress on channel 2 or force
                                       ///< a DMA0 transfer to start on channel 2.            
                                                                                              
