ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define DMA0NCF0_STALL__BMASK             0x20 ///< Channel Stall                                     
#define DMA0NCF0_STALL__SHIFT             0x05 ///< Channel Stall                                     
#define DMA0NCF0_STALL__NOT_SET           0x00 ///< The DMA transfer of the selected channel is not   
                                               ///< stalled.                                          
#define DMA0NCF0_STALL__SET               0x20 ///< The DMA transfer of the selected channel is       
                                               ///< stalled.                                          
                                                                                                      
#define DMA0NCF0_MIEN__BMASK              0x40 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF0_MIEN__SHIFT              0x06 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF0_MIEN__DISABLED           0x00 ///< Disable the DMA0 mid-point interrupt request of   
                                               ///< the selected channel.                             
#define DMA0NCF0_MIEN__ENABLED            0x40 ///< Enable the DMA0 mid-point interrupt request of the
                                               ///< selected channel.                                 
                                                                                                      
#define DMA0NCF0_IEN__BMASK               0x80 ///< Full-Length Interrupt Enable                      
#define DMA0NCF0_IEN__SHIFT               0x07 ///< Full-Length Interrupt Enable                      
#define DMA0NCF0_IEN__DISABLED            0x00 ///< Disable the DMA0 full-length interrupt request of 
                                               ///< the selected channel.                             
#define DMA0NCF0_IEN__ENABLED             0x80 ///< Enable the DMA0 full-length interrupt request of  
                                               ///< the selected channel.                             
                                                                                                      
//------------------------------------------------------------------------------
// DMA0NCF1 Enums (DMA0 Channel 1 Configuration @ 0x01)
//------------------------------------------------------------------------------
#define DMA0NCF1_PERIPH__FMASK            0x07 ///< Peripheral Transfer Select                        
#define DMA0NCF1_PERIPH__SHIFT            0x00 ///< Peripheral Transfer Select                        
#define DMA0NCF1_PERIPH__XRAM_TO_MAC_A    0x02 ///< The DMA channel transfers from XRAM to the MAC A  
                                               ///< register.                                         
#define DMA0NCF1_PERIPH__XRAM_TO_MAC_B    0x03 ///< The DMA channel transfers from XRAM to the MAC B  
                                               ///< register.                                         
#define DMA0NCF1_PERIPH__XRAM_TO_MAC_ACC  0x04 ///< The DMA channel transfers from XRAM to the MAC    
                                               ///< accumulator registers.                            
#define DMA0NCF1_PERIPH__MAC_ACC_TO_XRAM  0x05 ///< The DMA channel transfers from the MAC accumulator
                                               ///< registers to XRAM.                                
#define DMA0NCF1_PERIPH__XRAM_TO_I2C_DATA 0x06 ///< The DMA channel transfers from XRAM to the I2C    
                                               ///< Slave data register.                              
#define DMA0NCF1_PERIPH__I2C_DATA_TO_XRAM 0x07 ///< The DMA channel transfers from the I2C Slave data 
                                               ///< register to XRAM.                                 
                                                                                                      
#define DMA0NCF1_ENDIAN__BMASK            0x10 ///< Data Transfer Endianness                          
#define DMA0NCF1_ENDIAN__SHIFT            0x04 ///< Data Transfer Endianness                          
#define DMA0NCF1_ENDIAN__LITTLE           0x00 ///< Data is written to and read from XRAM in little   
                                               ///< endian order.                                     
#define DMA0NCF1_ENDIAN__BIG              0x10 ///< Data is written to and read from XRAM in big      
                                               ///< endian order.                                     
                                                                                                      
#define DMA0NCF1_STALL__BMASK             0x20 ///< Channel Stall                                     
#define DMA0NCF1_STALL__SHIFT             0x05 ///< Channel Stall                                     
#define DMA0NCF1_STALL__NOT_SET           0x00 ///< The DMA transfer of the selected channel is not   
                                               ///< stalled.                                          
#define DMA0NCF1_STALL__SET               0x20 ///< The DMA transfer of the selected channel is       
                                               ///< stalled.                                          
                                                                                                      
#define DMA0NCF1_MIEN__BMASK              0x40 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF1_MIEN__SHIFT              0x06 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF1_MIEN__DISABLED           0x00 ///< Disable the DMA0 mid-point interrupt request of   
                                               ///< the selected channel.                             
#define DMA0NCF1_MIEN__ENABLED            0x40 ///< Enable the DMA0 mid-point interrupt request of the
                                               ///< selected channel.                                 
                                                                                                      
#define DMA0NCF1_IEN__BMASK               0x80 ///< Full-Length Interrupt Enable                      
#define DMA0NCF1_IEN__SHIFT               0x07 ///< Full-Length Interrupt Enable                      
#define DMA0NCF1_IEN__DISABLED            0x00 ///< Disable the DMA0 full-length interrupt request of 
                                               ///< the selected channel.                             
#define DMA0NCF1_IEN__ENABLED             0x80 ///< Enable the DMA0 full-length interrupt request of  
                                               ///< the selected channel.                             
                                                                                                      
//------------------------------------------------------------------------------
// DMA0NCF2 Enums (DMA0 Channel 2 Configuration @ 0x02)
//------------------------------------------------------------------------------
#define DMA0NCF2_PERIPH__FMASK            0x07 ///< Peripheral Transfer Select                        
#define DMA0NCF2_PERIPH__SHIFT            0x00 ///< Peripheral Transfer Select                        
#define DMA0NCF2_PERIPH__XRAM_TO_MAC_A    0x02 ///< The DMA channel transfers from XRAM to the MAC A  
                                               ///< register.                                         
#define DMA0NCF2_PERIPH__XRAM_TO_MAC_B    0x03 ///< The DMA channel transfers from XRAM to the MAC B  
                                               ///< register.                                         
#define DMA0NCF2_PERIPH__XRAM_TO_MAC_ACC  0x04 ///< The DMA channel transfers from XRAM to the MAC    
                                               ///< accumulator registers.                            
#define DMA0NCF2_PERIPH__MAC_ACC_TO_XRAM  0x05 ///< The DMA channel transfers from the MAC accumulator
                                               ///< registers to XRAM.                                
#define DMA0NCF2_PERIPH__XRAM_TO_I2C_DATA 0x06 ///< The DMA channel transfers from XRAM to the I2C    
                                               ///< Slave data register.                              
#define DMA0NCF2_PERIPH__I2C_DATA_TO_XRAM 0x07 ///< The DMA channel transfers from the I2C Slave data 
                                               ///< register to XRAM.                                 
                                                                                                      
#define DMA0NCF2_ENDIAN__BMASK            0x10 ///< Data Transfer Endianness                          
#define DMA0NCF2_ENDIAN__SHIFT            0x04 ///< Data Transfer Endianness                          
#define DMA0NCF2_ENDIAN__LITTLE           0x00 ///< Data is written to and read from XRAM in little   
                                               ///< endian order.                                     
#define DMA0NCF2_ENDIAN__BIG              0x10 ///< Data is written to and read from XRAM in big      
                                               ///< endian order.                                     
                                                                                                      
#define DMA0NCF2_STALL__BMASK             0x20 ///< Channel Stall                                     
#define DMA0NCF2_STALL__SHIFT             0x05 ///< Channel Stall                                     
#define DMA0NCF2_STALL__NOT_SET           0x00 ///< The DMA transfer of the selected channel is not   
                                               ///< stalled.                                          
#define DMA0NCF2_STALL__SET               0x20 ///< The DMA transfer of the selected channel is       
                                               ///< stalled.                                          
                                                                                                      
#define DMA0NCF2_MIEN__BMASK              0x40 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF2_MIEN__SHIFT              0x06 ///< Mid-Point Interrupt Enable                        
#define DMA0NCF2_MIEN__DISABLED           0x00 ///< Disable the DMA0 mid-point interrupt request of   
                                               ///< the selected channel.                             
#define DMA0NCF2_MIEN__ENABLED            0x40 ///< Enable the DMA0 mid-point interrupt request of the
                                               ///< selected channel.                                 
                                                                                                      
#define DMA0NCF2_IEN__BMASK               0x80 ///< Full-Length Interrupt Enable                      
#define DMA0NCF2_IEN__SHIFT               0x07 ///< Full-Length Interrupt Enable                      
#define DMA0NCF2_IEN__DISABLED            0x00 ///< Disable the DMA0 full-length interrupt request of 
                                               ///< the selected channel.                             
#define DMA0NCF2_IEN__ENABLED             0x80 ///< Enable the DMA0 full-length interrupt request of  
                                               ///< the selected channel.                             
                                                                                                      
//------------------------------------------------------------------------------
// DMA0NCF3 Enums (DMA0 Channel 3 Configuration @ 0x03)
//------------------------------------------------------------------------------
#define DMA0NCF3_PERIPH__FMASK            0x07 ///< Peripheral Transfer Select                        
#define DMA0NCF3_PERIPH__SHIFT            0x00 ///< Peripheral Transfer Select                        
#define DMA0NCF3_PERIPH__XRAM_TO_MAC_A    0x02 ///< The DMA channel transfers from XRAM to the MAC A  
                                               ///< register.                                         
#define DMA0NCF3_PERIPH__XRAM_TO_MAC_B    0x03 ///< The DMA channel transfers from XRAM to the MAC B  
                                               ///< register.                                         
#define DMA0NCF3_PERIPH__XRAM_TO_MAC_ACC  0x04 ///< The DMA channel transfers from XRAM to the MAC    
                                               ///< accumulator registers.                            
#define DMA0NCF3_PERIPH__MAC_ACC_TO_XRAM  0x05 ///< The DMA channel transfers from the MAC accumulator
                                               ///< registers to XRAM.                                
#define DMA0NCF3_PERIPH__XRAM_TO_I2C_DATA 0x06 ///< The DMA channel transfers from XRAM to the I2C    
                                               ///< Slave data register.                              
#define DMA0NCF3_PERIPH__I2C_DATA_TO_XRAM 0x07 ///< The DMA channel transfers from the I2C Slave data 
                                               ///< register to XRAM.                                 
                                                                                                      
