ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xAF)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x7F ///< Oscillator Calibration                   
#define OSCICL_OSCICL__SHIFT 0x00 ///< Oscillator Calibration                   
                                                                                
#define OSCICL_SSE__BMASK    0x80 ///< Spread Spectrum Enable                   
#define OSCICL_SSE__SHIFT    0x07 ///< Spread Spectrum Enable                   
#define OSCICL_SSE__DISABLED 0x00 ///< Spread Spectrum clock dithering disabled.
#define OSCICL_SSE__ENABLED  0x80 ///< Spread Spectrum clock dithering enabled. 
                                                                                
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFRDY__BMASK     0x40 ///< Internal Oscillator Frequency Ready Flag       
#define OSCICN_IFRDY__SHIFT     0x06 ///< Internal Oscillator Frequency Ready Flag       
#define OSCICN_IFRDY__NOT_SET   0x00 ///< High Frequency Oscillator is not running at its
                                     ///< programmed frequency.                          
#define OSCICN_IFRDY__SET       0x40 ///< High Frequency Oscillator is running at its    
                                     ///< programmed frequency.                          
                                                                                         
#define OSCICN_IOSCEN__BMASK    0x80 ///< High Frequency Oscillator Enable               
#define OSCICN_IOSCEN__SHIFT    0x07 ///< High Frequency Oscillator Enable               
#define OSCICN_IOSCEN__DISABLED 0x00 ///< High Frequency Oscillator disabled.            
#define OSCICN_IOSCEN__ENABLED  0x80 ///< High Frequency Oscillator enabled.             
                                                                                         
//------------------------------------------------------------------------------
// I2C0CN Enums (I2C0 Control @ 0xAC)
//------------------------------------------------------------------------------
#define I2C0CN_BUSY__BMASK       0x01 ///< Busy                                              
#define I2C0CN_BUSY__SHIFT       0x00 ///< Busy                                              
#define I2C0CN_BUSY__NOT_SET     0x00 ///< Device will acknowledge an I2C master.            
#define I2C0CN_BUSY__SET         0x01 ///< Device will not respond to an I2C master. All I2C 
                                      ///< data sent to the device will be NACKed.           
                                                                                             
#define I2C0CN_I2C0EN__BMASK     0x02 ///< I2C Enable                                        
#define I2C0CN_I2C0EN__SHIFT     0x01 ///< I2C Enable                                        
#define I2C0CN_I2C0EN__DISABLED  0x00 ///< Disable the I2C0 Slave module.                    
#define I2C0CN_I2C0EN__ENABLED   0x02 ///< Enable the I2C0 Slave module.                     
                                                                                             
#define I2C0CN_PRELOAD__BMASK    0x04 ///< Preload Disable                                   
#define I2C0CN_PRELOAD__SHIFT    0x02 ///< Preload Disable                                   
#define I2C0CN_PRELOAD__ENABLED  0x00 ///< Data bytes must be written into the I2C0DOUT      
                                      ///< register before the 8th SCL clock of the matching 
                                      ///< slave address byte transfer arrives for an I2C    
                                      ///< read operation.                                   
#define I2C0CN_PRELOAD__DISABLED 0x04 ///< Data bytes need not be preloaded for I2C read     
                                      ///< operations. The data byte can be written to       
                                      ///< I2C0DOUT during interrupt servicing or by the DMA.
                                                                                             
#define I2C0CN_TIMEOUT__BMASK    0x08 ///< Timeout Enable                                    
#define I2C0CN_TIMEOUT__SHIFT    0x03 ///< Timeout Enable                                    
#define I2C0CN_TIMEOUT__DISABLED 0x00 ///< Disable I2C SCL timeout detection using Timer 3.  
#define I2C0CN_TIMEOUT__ENABLED  0x08 ///< Enable I2C SCL timeout detection using Timer 3.   
                                                                                             
#define I2C0CN_PINMD__BMASK      0x10 ///< Pin Mode Enable                                   
#define I2C0CN_PINMD__SHIFT      0x04 ///< Pin Mode Enable                                   
#define I2C0CN_PINMD__GPIO_MODE  0x00 ///< Set the I2C0 Slave pins in GPIO mode.             
#define I2C0CN_PINMD__I2C_MODE   0x10 ///< Set the I2C0 Slave pins in I2C mode.              
                                                                                             
#define I2C0CN_PUEN__BMASK       0x20 ///< I2C Pull-Up Enable                                
#define I2C0CN_PUEN__SHIFT       0x05 ///< I2C Pull-Up Enable                                
#define I2C0CN_PUEN__DISABLED    0x00 ///< Disable internal pull-up resistors for the I2C0   
                                      ///< Slave SCL and SDA pins.                           
#define I2C0CN_PUEN__ENABLED     0x20 ///< Enable internal pull-up resistors for the I2C0    
                                      ///< Slave SCL and SDA pins.                           
                                                                                             
//------------------------------------------------------------------------------
// I2C0DIN Enums (I2C0 Received Data @ 0xA5)
//------------------------------------------------------------------------------
#define I2C0DIN_I2C0DIN__FMASK 0xFF ///< I2C0 Received Data
#define I2C0DIN_I2C0DIN__SHIFT 0x00 ///< I2C0 Received Data
                                                           
//------------------------------------------------------------------------------
// I2C0DOUT Enums (I2C0 Transmit Data @ 0xA4)
//------------------------------------------------------------------------------
#define I2C0DOUT_I2C0DOUT__FMASK 0xFF ///< I2C0 Transmit Data
#define I2C0DOUT_I2C0DOUT__SHIFT 0x00 ///< I2C0 Transmit Data
                                                             
//------------------------------------------------------------------------------
// I2C0SLAD Enums (I2C0 Slave Address @ 0xAD)
//------------------------------------------------------------------------------
#define I2C0SLAD_I2C0SLAD__FMASK 0x7F ///< I2C Hardware Slave Address
#define I2C0SLAD_I2C0SLAD__SHIFT 0x00 ///< I2C Hardware Slave Address
                                                                     
//------------------------------------------------------------------------------
// I2C0STAT Enums (I2C0 Status @ 0xF8)
//------------------------------------------------------------------------------
#define I2C0STAT_RD__BMASK        0x01 ///< I2C Read                                        
#define I2C0STAT_RD__SHIFT        0x00 ///< I2C Read                                        
#define I2C0STAT_RD__NOT_SET      0x00 ///< An I2C Read operation is not in progress.       
#define I2C0STAT_RD__SET          0x01 ///< An I2C Read operation is in progress.           
                                                                                            
#define I2C0STAT_WR__BMASK        0x02 ///< I2C Write                                       
#define I2C0STAT_WR__SHIFT        0x01 ///< I2C Write                                       
#define I2C0STAT_WR__NOT_SET      0x00 ///< An I2C Write operation is not in progress.      
#define I2C0STAT_WR__SET          0x02 ///< An I2C Write operation is in progress.          
                                                                                            
#define I2C0STAT_STOP__BMASK      0x04 ///< Stop                                            
#define I2C0STAT_STOP__SHIFT      0x02 ///< Stop                                            
#define I2C0STAT_STOP__NOT_SET    0x00 ///< A STOP is not pending.                          
#define I2C0STAT_STOP__SET        0x04 ///< A STOP is currently pending for the I2C0 Slave. 
                                                                                            
#define I2C0STAT_START__BMASK     0x08 ///< Start                                           
#define I2C0STAT_START__SHIFT     0x03 ///< Start                                           
#define I2C0STAT_START__NOT_SET   0x00 ///< A START was not detected.                       
#define I2C0STAT_START__SET       0x08 ///< A START is currently pending for the I2C0 Slave.
                                                                                            
#define I2C0STAT_NACK__BMASK      0x10 ///< NACK                                            
#define I2C0STAT_NACK__SHIFT      0x04 ///< NACK                                            
#define I2C0STAT_NACK__NOT_SET    0x00 ///< A NACK did not occur.                           
#define I2C0STAT_NACK__SET        0x10 ///< A NACK occurred.                                
                                                                                            
#define I2C0STAT_I2C0INT__BMASK   0x20 ///< I2C Interrupt                                   
#define I2C0STAT_I2C0INT__SHIFT   0x05 ///< I2C Interrupt                                   
#define I2C0STAT_I2C0INT__NOT_SET 0x00 ///< An interrupt did not occur.                     
#define I2C0STAT_I2C0INT__SET     0x20 ///< An interrupt occurred.                          
                                                                                            
#define I2C0STAT_ACTIVE__BMASK    0x40 ///< Bus Active                                      
#define I2C0STAT_ACTIVE__SHIFT    0x06 ///< Bus Active                                      
#define I2C0STAT_ACTIVE__NOT_SET  0x00 ///< A transfer is not in progress.                  
#define I2C0STAT_ACTIVE__SET      0x40 ///< A transfer is in progress.                      
                                                                                            
