ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define I2C0STAT_HSMODE__BMASK    0x80 ///< High Speed Mode                                 
#define I2C0STAT_HSMODE__SHIFT    0x07 ///< High Speed Mode                                 
#define I2C0STAT_HSMODE__NOT_SET  0x00 ///< A High Speed transfer is not in progress.       
#define I2C0STAT_HSMODE__SET      0x80 ///< A High Speed transfer is in progress.           
                                                                                            
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_ERTC0A__BMASK    0x02 ///< RTC Alarm Interrupts Enable                       
#define EIE1_ERTC0A__SHIFT    0x01 ///< RTC Alarm Interrupts Enable                       
#define EIE1_ERTC0A__DISABLED 0x00 ///< Disable RTC Alarm interrupts.                     
#define EIE1_ERTC0A__ENABLED  0x02 ///< Enable interrupt requests generated by a RTC      
                                   ///< Alarm.                                            
                                                                                          
#define EIE1_EWADC0__BMASK    0x04 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x02 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x04 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x08 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x03 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x08 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE1_EPCA0__BMASK     0x10 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x10 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_EDMA0M__BMASK    0x20 ///< DMA0 Mid-Point Interrupt Enable                   
#define EIE1_EDMA0M__SHIFT    0x05 ///< DMA0 Mid-Point Interrupt Enable                   
#define EIE1_EDMA0M__DISABLED 0x00 ///< Disable DMA0M interrupts.                         
#define EIE1_EDMA0M__ENABLED  0x20 ///< Enable interrupt requests generated by the DMA0M  
                                   ///< flags.                                            
                                                                                          
#define EIE1_EDMA0__BMASK     0x40 ///< DMA0 Interrupt Enable                             
#define EIE1_EDMA0__SHIFT     0x06 ///< DMA0 Interrupt Enable                             
#define EIE1_EDMA0__DISABLED  0x00 ///< Disable DMA0 interrupts.                          
#define EIE1_EDMA0__ENABLED   0x40 ///< Enable interrupt requests generated by DMA0.      
                                                                                          
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                         
#define EIE2_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                         
#define EIE2_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                   
#define EIE2_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port        
                                   ///< Match.                                               
                                                                                             
#define EIE2_ERTC0F__BMASK    0x04 ///< RTC Oscillator Fail Interrupt Enable                 
#define EIE2_ERTC0F__SHIFT    0x02 ///< RTC Oscillator Fail Interrupt Enable                 
#define EIE2_ERTC0F__DISABLED 0x00 ///< Disable RTC Alarm interrupts.                        
#define EIE2_ERTC0F__ENABLED  0x04 ///< Enable interrupt requests generated by the RTC       
                                   ///< Alarm.                                               
                                                                                             
