ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt set to low priority level.                 
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt set to high priority level.                
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt set to low priority level.                   
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt set to high priority level.                  
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt set to low priority level.                 
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt set to high priority level.                
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// MAC0ACC0 Enums (Accumulator Byte 0 @ 0xD2)
//------------------------------------------------------------------------------
#define MAC0ACC0_MAC0ACC0__FMASK 0xFF ///< MAC0 Accumulator Byte 0
#define MAC0ACC0_MAC0ACC0__SHIFT 0x00 ///< MAC0 Accumulator Byte 0
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC1 Enums (Accumulator Byte 1 @ 0xD3)
//------------------------------------------------------------------------------
#define MAC0ACC1_MAC0ACC1__FMASK 0xFF ///< MAC0 Accumulator Byte 1
#define MAC0ACC1_MAC0ACC1__SHIFT 0x00 ///< MAC0 Accumulator Byte 1
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC2 Enums (Accumulator Byte 2 @ 0xD4)
//------------------------------------------------------------------------------
#define MAC0ACC2_MAC0ACC2__FMASK 0xFF ///< MAC0 Accumulator Byte 2
#define MAC0ACC2_MAC0ACC2__SHIFT 0x00 ///< MAC0 Accumulator Byte 2
                                                                  
//------------------------------------------------------------------------------
// MAC0ACC3 Enums (Accumulator Byte 3 @ 0xD5)
//------------------------------------------------------------------------------
#define MAC0ACC3_MAC0ACC3__FMASK 0xFF ///< MAC0 Accumulator Byte 3
#define MAC0ACC3_MAC0ACC3__SHIFT 0x00 ///< MAC0 Accumulator Byte 3
                                                                  
//------------------------------------------------------------------------------
// MAC0AH Enums (Operand A High Byte @ 0xAB)
//------------------------------------------------------------------------------
#define MAC0AH_MAC0AH__FMASK 0xFF ///< MAC0 A High Byte
#define MAC0AH_MAC0AH__SHIFT 0x00 ///< MAC0 A High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0AL Enums (Operand A Low Byte @ 0xAA)
//------------------------------------------------------------------------------
#define MAC0AL_MAC0AL__FMASK 0xFF ///< MAC0 A Low Byte
#define MAC0AL_MAC0AL__SHIFT 0x00 ///< MAC0 A Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0BH Enums (Operand B High Byte @ 0xAF)
//------------------------------------------------------------------------------
#define MAC0BH_MAC0BH__FMASK 0xFF ///< MAC0 B High Byte
#define MAC0BH_MAC0BH__SHIFT 0x00 ///< MAC0 B High Byte
                                                       
//------------------------------------------------------------------------------
// MAC0BL Enums (Operand B Low Byte @ 0xAE)
//------------------------------------------------------------------------------
#define MAC0BL_MAC0BL__FMASK 0xFF ///< MAC0 B Low Byte
#define MAC0BL_MAC0BL__SHIFT 0x00 ///< MAC0 B Low Byte
                                                      
//------------------------------------------------------------------------------
// MAC0CF0 Enums (MAC0 Configuration 0 @ 0xC0)
//------------------------------------------------------------------------------
#define MAC0CF0_ANEGATE__BMASK      0x01 ///< Negate A input                                   
#define MAC0CF0_ANEGATE__SHIFT      0x00 ///< Negate A input                                   
#define MAC0CF0_ANEGATE__DISABLED   0x00 ///< No change is applied to the MAC0 A input before  
                                         ///< the multiply operation.                          
#define MAC0CF0_ANEGATE__ENABLED    0x01 ///< Hardware negates the MAC0 A input before the     
                                         ///< multiply operation.                              
                                                                                               
#define MAC0CF0_BNEGATE__BMASK      0x02 ///< Negate B input                                   
#define MAC0CF0_BNEGATE__SHIFT      0x01 ///< Negate B input                                   
#define MAC0CF0_BNEGATE__DISABLED   0x00 ///< No change is applied to the MAC0 B input before  
                                         ///< the multiply operation.                          
#define MAC0CF0_BNEGATE__ENABLED    0x02 ///< Hardware negates the MAC0 B input before the     
                                         ///< multiply operation.                              
                                                                                               
#define MAC0CF0_ACCNEGATE__BMASK    0x04 ///< Negate Accumulator Input                         
#define MAC0CF0_ACCNEGATE__SHIFT    0x02 ///< Negate Accumulator Input                         
#define MAC0CF0_ACCNEGATE__DISABLED 0x00 ///< No change is applied to the accumulator before it
                                         ///< is added to the multiplication result of A and B.
#define MAC0CF0_ACCNEGATE__ENABLED  0x04 ///< Hardware negates the accumulator before it is    
                                         ///< added to the multiplication result of A and B.   
                                                                                               
#define MAC0CF0_ACCMD__BMASK        0x08 ///< Accumulate Mode                                  
#define MAC0CF0_ACCMD__SHIFT        0x03 ///< Accumulate Mode                                  
#define MAC0CF0_ACCMD__MAC_MODE     0x00 ///< Select multiply-and-accumulate (MAC) mode.       
#define MAC0CF0_ACCMD__MUL_MODE     0x08 ///< Select multiply-only mode.                       
                                                                                               
#define MAC0CF0_FRACMD__BMASK       0x10 ///< Fractional Mode                                  
#define MAC0CF0_FRACMD__SHIFT       0x04 ///< Fractional Mode                                  
#define MAC0CF0_FRACMD__INT_MODE    0x00 ///< MAC0 operates in Integer Mode.                   
#define MAC0CF0_FRACMD__FRAC_MODE   0x10 ///< MAC0 operates in Fractional Mode.                
                                                                                               
