ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define MAC0CF0_CLRACC__BMASK       0x20 ///< Clear Accumulator                                
#define MAC0CF0_CLRACC__SHIFT       0x05 ///< Clear Accumulator                                
#define MAC0CF0_CLRACC__START       0x20 ///< Clear the accumulator and the related MAC0STA    
                                         ///< register flags.                                  
                                                                                               
#define MAC0CF0_SHIFTDIR__BMASK     0x40 ///< Accumulator Shift Direction                      
#define MAC0CF0_SHIFTDIR__SHIFT     0x06 ///< Accumulator Shift Direction                      
#define MAC0CF0_SHIFTDIR__LEFT      0x00 ///< The MAC0 accumulator will be shifted left.       
#define MAC0CF0_SHIFTDIR__RIGHT     0x40 ///< The MAC0 accumulator will be shifted right.      
                                                                                               
#define MAC0CF0_SHIFTEN__BMASK      0x80 ///< Accumulator Shift Control                        
#define MAC0CF0_SHIFTEN__SHIFT      0x07 ///< Accumulator Shift Control                        
#define MAC0CF0_SHIFTEN__DISABLED   0x00 ///< Do not shift the accumulator by one bit in the   
                                         ///< SHIFTDIR direction.                              
#define MAC0CF0_SHIFTEN__ENABLED    0x80 ///< Shift the accumulator by one bit in the SHIFTDIR 
                                         ///< direction.                                       
                                                                                               
//------------------------------------------------------------------------------
// MAC0CF1 Enums (MAC0 Configuration 1 @ 0xC4)
//------------------------------------------------------------------------------
#define MAC0CF1_APOSTINC__BMASK    0x01 ///< A Post-Increment Enable                           
#define MAC0CF1_APOSTINC__SHIFT    0x00 ///< A Post-Increment Enable                           
#define MAC0CF1_APOSTINC__DISABLED 0x00 ///< Do not change the MAC0 A register after a MAC0    
                                        ///< operation.                                        
#define MAC0CF1_APOSTINC__ENABLED  0x01 ///< Increment the MAC0 A register after a MAC0        
                                        ///< operation.                                        
                                                                                               
#define MAC0CF1_ADMASRC__BMASK     0x02 ///< A DMA Data Source Selection                       
#define MAC0CF1_ADMASRC__SHIFT     0x01 ///< A DMA Data Source Selection                       
#define MAC0CF1_ADMASRC__XRAM      0x00 ///< Each MAC0 operation will request the DMA fetch    
                                        ///< data from XRAM for the MAC0 A register.           
#define MAC0CF1_ADMASRC__EXISTING  0x02 ///< Each MAC0 operation will use existing data in MAC0
                                        ///< A register.                                       
                                                                                               
#define MAC0CF1_BPOSTINC__BMASK    0x04 ///< B Post-Increment Enable                           
#define MAC0CF1_BPOSTINC__SHIFT    0x02 ///< B Post-Increment Enable                           
#define MAC0CF1_BPOSTINC__DISABLED 0x00 ///< Do not change the MAC0 B register after a MAC0    
                                        ///< operation.                                        
#define MAC0CF1_BPOSTINC__ENABLED  0x04 ///< Increment the MAC0 B register after a MAC0        
                                        ///< operation.                                        
                                                                                               
#define MAC0CF1_MAC0BC__BMASK      0x08 ///< B DMA Data Source Selection                       
#define MAC0CF1_MAC0BC__SHIFT      0x03 ///< B DMA Data Source Selection                       
#define MAC0CF1_MAC0BC__XRAM       0x00 ///< Each MAC0 operation will request the DMA fetch    
                                        ///< data from XRAM for the MAC0 B register.           
#define MAC0CF1_MAC0BC__EXISTING   0x08 ///< Each MAC0 operation will use existing data in MAC0
                                        ///< B register.                                       
                                                                                               
#define MAC0CF1_SIGNEDEN__BMASK    0x10 ///< Signed Mode Enable                                
#define MAC0CF1_SIGNEDEN__SHIFT    0x04 ///< Signed Mode Enable                                
#define MAC0CF1_SIGNEDEN__DISABLED 0x00 ///< MAC operations use unsigned arithmetic.           
#define MAC0CF1_SIGNEDEN__ENABLED  0x10 ///< MAC operations use signed arithmetic.             
                                                                                               
#define MAC0CF1_SIGNEXP__BMASK     0x20 ///< Expected Accumulator Sign                         
#define MAC0CF1_SIGNEXP__SHIFT     0x05 ///< Expected Accumulator Sign                         
#define MAC0CF1_SIGNEXP__NOT_SET   0x00 ///< Set the expected sign to zero.                    
#define MAC0CF1_SIGNEXP__SET       0x20 ///< Set the expected sign to one.                     
                                                                                               
#define MAC0CF1_MBSHIFT__FMASK     0xC0 ///< Multi-Bit Accumulator Shift                       
#define MAC0CF1_MBSHIFT__SHIFT     0x06 ///< Multi-Bit Accumulator Shift                       
#define MAC0CF1_MBSHIFT__1_BIT     0x00 ///< Shift the accumulator 1 bit.                      
#define MAC0CF1_MBSHIFT__2_BITS    0x40 ///< Shift the accumulator by 2 bits.                  
#define MAC0CF1_MBSHIFT__3_BITS    0x80 ///< Shift the accumulator by 3 bits.                  
#define MAC0CF1_MBSHIFT__4_BITS    0xC0 ///< Shift the accumulator by 4 bits.                  
                                                                                               
//------------------------------------------------------------------------------
// MAC0CF2 Enums (MAC0 Configuration 2 @ 0xC5)
//------------------------------------------------------------------------------
#define MAC0CF2_ACCDMAIN__FMASK               0x03 ///< Accumulator DMA Input Count                       
#define MAC0CF2_ACCDMAIN__SHIFT               0x00 ///< Accumulator DMA Input Count                       
#define MAC0CF2_ACCDMAIN__1_BYTE              0x00 ///< Request the DMA move 1 byte from XRAM to the      
                                                   ///< accumulator.                                      
#define MAC0CF2_ACCDMAIN__2_BYTES             0x01 ///< Request the DMA move 2 bytes from XRAM to the     
                                                   ///< accumulator.                                      
#define MAC0CF2_ACCDMAIN__4_BYTES             0x02 ///< Request the DMA move 4 bytes from XRAM to the     
                                                   ///< accumulator.                                      
#define MAC0CF2_ACCDMAIN__5_BYTES             0x03 ///< Request the DMA move 5 bytes from XRAM to the     
                                                   ///< accumulator.                                      
                                                                                                          
#define MAC0CF2_ACCDMAOUT__FMASK              0x0C ///< Accumulator DMA Output Count                      
#define MAC0CF2_ACCDMAOUT__SHIFT              0x02 ///< Accumulator DMA Output Count                      
#define MAC0CF2_ACCDMAOUT__1_BYTE             0x00 ///< Request the DMA move 1 byte from the accumulator  
                                                   ///< to XRAM.                                          
#define MAC0CF2_ACCDMAOUT__2_BYTES            0x04 ///< Request the DMA move 2 bytes from the accumulator 
                                                   ///< to XRAM.                                          
#define MAC0CF2_ACCDMAOUT__4_BYTES            0x08 ///< Request the DMA move 4 bytes from the accumulator 
                                                   ///< to XRAM.                                          
#define MAC0CF2_ACCDMAOUT__5_BYTES            0x0C ///< Request the DMA move 5 bytes from the accumulator 
                                                   ///< to XRAM.                                          
                                                                                                          
