ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define MAC0CF2_ACCALIGN__FMASK               0x30 ///< Accumulator Alignment                             
#define MAC0CF2_ACCALIGN__SHIFT               0x04 ///< Accumulator Alignment                             
#define MAC0CF2_ACCALIGN__NO_SHIFT            0x00 ///< Do not shift the accumulator output.              
#define MAC0CF2_ACCALIGN__SHIFT_RIGHT_1_BYTE  0x10 ///< Shift the accumulator output right by 1 byte.     
#define MAC0CF2_ACCALIGN__SHIFT_RIGHT_3_BYTES 0x20 ///< Shift the accumulator output right by 3 bytes.    
#define MAC0CF2_ACCALIGN__SHIFT_RIGHT_4_BYTES 0x30 ///< Shift the accumulator output right by 4 bytes.    
                                                                                                          
#define MAC0CF2_SATURATE__BMASK               0x40 ///< Saturation Enable                                 
#define MAC0CF2_SATURATE__SHIFT               0x06 ///< Saturation Enable                                 
#define MAC0CF2_SATURATE__DISABLED            0x00 ///< Rounded result will not saturate.                 
#define MAC0CF2_SATURATE__ENABLED             0x40 ///< Rounded result will saturate.                     
                                                                                                          
#define MAC0CF2_ROUND__BMASK                  0x80 ///< Rounding Enable                                   
#define MAC0CF2_ROUND__SHIFT                  0x07 ///< Rounding Enable                                   
#define MAC0CF2_ROUND__DISABLED               0x00 ///< MAC0 accumulator does not contain a 16-bit rounded
                                                   ///< result.                                           
#define MAC0CF2_ROUND__ENABLED                0x80 ///< MAC0 accumulator contains a 16-bit rounded result.
                                                                                                          
//------------------------------------------------------------------------------
// MAC0INTE Enums (MAC0 Interrupt Enable @ 0xC1)
//------------------------------------------------------------------------------
#define MAC0INTE_SOVFIEN__BMASK       0x01 ///< Soft Overflow Interrupt Enable    
#define MAC0INTE_SOVFIEN__SHIFT       0x00 ///< Soft Overflow Interrupt Enable    
#define MAC0INTE_SOVFIEN__DISABLED    0x00 ///< Disable soft overflow interrupts. 
#define MAC0INTE_SOVFIEN__ENABLED     0x01 ///< Enable soft overflow interrupts.  
                                                                                  
#define MAC0INTE_ZEROFIEN__BMASK      0x02 ///< Zero Flag Interrupt Enable        
#define MAC0INTE_ZEROFIEN__SHIFT      0x01 ///< Zero Flag Interrupt Enable        
#define MAC0INTE_ZEROFIEN__DISABLED   0x00 ///< Disable zero flag interrupts.     
#define MAC0INTE_ZEROFIEN__ENABLED    0x02 ///< Enable zero flag interrupts.      
                                                                                  
#define MAC0INTE_SCHANGEIEN__BMASK    0x04 ///< Sign Change Event Interrupt Enable
#define MAC0INTE_SCHANGEIEN__SHIFT    0x02 ///< Sign Change Event Interrupt Enable
#define MAC0INTE_SCHANGEIEN__DISABLED 0x00 ///< Disable sign change interrupts.   
#define MAC0INTE_SCHANGEIEN__ENABLED  0x04 ///< Enable sign change interrupts.    
                                                                                  
//------------------------------------------------------------------------------
// MAC0ITER Enums (Iteration Counter @ 0xD7)
//------------------------------------------------------------------------------
#define MAC0ITER_MAC0ITER__FMASK 0xFF ///< Iteration Counter
#define MAC0ITER_MAC0ITER__SHIFT 0x00 ///< Iteration Counter
                                                            
//------------------------------------------------------------------------------
// MAC0OVF Enums (Accumulator Overflow Byte @ 0xD6)
//------------------------------------------------------------------------------
#define MAC0OVF_MAC0OVF__FMASK 0xFF ///< MAC0 Accumulator Overflow Byte
#define MAC0OVF_MAC0OVF__SHIFT 0x00 ///< MAC0 Accumulator Overflow Byte
                                                                       
//------------------------------------------------------------------------------
// MAC0STA Enums (MAC0 Status @ 0xCF)
//------------------------------------------------------------------------------
#define MAC0STA_BUSY__BMASK      0x01 ///< Busy Flag                                         
#define MAC0STA_BUSY__SHIFT      0x00 ///< Busy Flag                                         
#define MAC0STA_BUSY__NOT_SET    0x00 ///< The MAC module is not busy with an operation or   
                                      ///< series of operations.                             
#define MAC0STA_BUSY__SET        0x01 ///< The MAC module is busy with an operation or series
                                      ///< of operations.                                    
                                                                                             
#define MAC0STA_SOVF__BMASK      0x02 ///< Soft Overflow Flag                                
#define MAC0STA_SOVF__SHIFT      0x01 ///< Soft Overflow Flag                                
#define MAC0STA_SOVF__NOT_SET    0x00 ///< A soft overflow did not occur.                    
#define MAC0STA_SOVF__SET        0x02 ///< A soft overflow occurred.                         
                                                                                             
#define MAC0STA_ZEROF__BMASK     0x04 ///< Zero Flag                                         
#define MAC0STA_ZEROF__SHIFT     0x02 ///< Zero Flag                                         
#define MAC0STA_ZEROF__NOT_SET   0x00 ///< The last operation did not result in an           
                                      ///< accumulator value of zero.                        
#define MAC0STA_ZEROF__SET       0x04 ///< The last operation resulted in an accumulator     
                                      ///< value of zero.                                    
                                                                                             
#define MAC0STA_HOVF__BMASK      0x08 ///< Hard Overflow Flag                                
#define MAC0STA_HOVF__SHIFT      0x03 ///< Hard Overflow Flag                                
#define MAC0STA_HOVF__NOT_SET    0x00 ///< A hardware overflow did not occur.                
#define MAC0STA_HOVF__SET        0x08 ///< A hardware overflow occurred.                     
                                                                                             
#define MAC0STA_ACCRDY__BMASK    0x10 ///< ACC Ready Status Flag                             
#define MAC0STA_ACCRDY__SHIFT    0x04 ///< ACC Ready Status Flag                             
#define MAC0STA_ACCRDY__NOT_SET  0x00 ///< A MAC operation did not complete.                 
#define MAC0STA_ACCRDY__SET      0x10 ///< A MAC operation completed.                        
                                                                                             
#define MAC0STA_SCHANGE__BMASK   0x20 ///< Sign Change Event                                 
#define MAC0STA_SCHANGE__SHIFT   0x05 ///< Sign Change Event                                 
#define MAC0STA_SCHANGE__NOT_SET 0x00 ///< The accumulator result matches the expected sign  
                                      ///< (SIGNEXP) bit.                                    
#define MAC0STA_SCHANGE__SET     0x20 ///< The accumulator result does not match the expected
                                      ///< sign (SIGNEXP) bit.                               
                                                                                             
#define MAC0STA_MACINT__BMASK    0x40 ///< Interrupt Flag                                    
#define MAC0STA_MACINT__SHIFT    0x06 ///< Interrupt Flag                                    
#define MAC0STA_MACINT__NOT_SET  0x00 ///< An interrupt did not occur.                       
#define MAC0STA_MACINT__SET      0x40 ///< An interrupt occurred and is pending.             
                                                                                             
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0x95)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK           0x01 ///< UART I/O Output Enable                     
#define XBR0_URT0E__SHIFT           0x00 ///< UART I/O Output Enable                     
#define XBR0_URT0E__DISABLED        0x00 ///< UART I/O unavailable at Port pin.          
#define XBR0_URT0E__ENABLED         0x01 ///< UART TX, RX routed to Port pins.           
                                                                                         
#define XBR0_SPI0E__BMASK           0x02 ///< SPI I/O Enable                             
#define XBR0_SPI0E__SHIFT           0x01 ///< SPI I/O Enable                             
#define XBR0_SPI0E__DISABLED        0x00 ///< SPI I/O unavailable at Port pins.          
#define XBR0_SPI0E__ENABLED         0x02 ///< SPI I/O routed to Port pins. The SPI can be
                                         ///< assigned either 3 or 4 GPIO pins.          
                                                                                         
