ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define XBR0_SMB0E__BMASK           0x04 ///< SMBus0 I/O Enable                          
#define XBR0_SMB0E__SHIFT           0x02 ///< SMBus0 I/O Enable                          
#define XBR0_SMB0E__DISABLED        0x00 ///< SMBus0 I/O unavailable at Port pins.       
#define XBR0_SMB0E__ENABLED         0x04 ///< SMBus0 I/O routed to Port pins.            
                                                                                         
#define XBR0_SYSCKE__BMASK          0x08 ///< SYSCLK Output Enable                       
#define XBR0_SYSCKE__SHIFT          0x03 ///< SYSCLK Output Enable                       
#define XBR0_SYSCKE__DISABLED       0x00 ///< SYSCLK unavailable at Port pin.            
#define XBR0_SYSCKE__ENABLED        0x08 ///< SYSCLK output routed to Port pin.          
                                                                                         
#define XBR0_PCA0ME__FMASK          0x70 ///< PCA Module I/O Enable                      
#define XBR0_PCA0ME__SHIFT          0x04 ///< PCA Module I/O Enable                      
#define XBR0_PCA0ME__DISABLED       0x00 ///< All PCA I/O unavailable at Port pins.      
#define XBR0_PCA0ME__CEX0           0x10 ///< CEX0 routed to Port pin.                   
#define XBR0_PCA0ME__CEX0_CEX1      0x20 ///< CEX0, CEX1 routed to Port pins.            
#define XBR0_PCA0ME__CEX0_CEX1_CEX2 0x30 ///< CEX0, CEX1, CEX2 routed to Port pins.      
                                                                                         
#define XBR0_ECIE__BMASK            0x80 ///< PCA0 External Counter Input Enable         
#define XBR0_ECIE__SHIFT            0x07 ///< PCA0 External Counter Input Enable         
#define XBR0_ECIE__DISABLED         0x00 ///< ECI unavailable at Port pin.               
#define XBR0_ECIE__ENABLED          0x80 ///< ECI routed to Port pin.                    
                                                                                         
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0x96)
//------------------------------------------------------------------------------
#define XBR1_T0E__BMASK                 0x01 ///< T0 Enable                                       
#define XBR1_T0E__SHIFT                 0x00 ///< T0 Enable                                       
#define XBR1_T0E__DISABLED              0x00 ///< T0 unavailable at Port pin.                     
#define XBR1_T0E__ENABLED               0x01 ///< T0 routed to Port pin.                          
                                                                                                  
#define XBR1_T1E__BMASK                 0x02 ///< T1 Enable                                       
#define XBR1_T1E__SHIFT                 0x01 ///< T1 Enable                                       
#define XBR1_T1E__DISABLED              0x00 ///< T1 unavailable at Port pin.                     
#define XBR1_T1E__ENABLED               0x02 ///< T1 routed to Port pin.                          
                                                                                                  
#define XBR1_XBARE__BMASK               0x40 ///< Crossbar Enable                                 
#define XBR1_XBARE__SHIFT               0x06 ///< Crossbar Enable                                 
#define XBR1_XBARE__DISABLED            0x00 ///< Crossbar disabled.                              
#define XBR1_XBARE__ENABLED             0x40 ///< Crossbar enabled.                               
                                                                                                  
#define XBR1_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable                    
#define XBR1_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable                    
#define XBR1_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for Ports whose I/O
                                             ///< are configured for analog mode).                
#define XBR1_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.                          
                                                                                                  
//------------------------------------------------------------------------------
// PCA0CN Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA0CN_CCF0__BMASK   0x01 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__SHIFT   0x00 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN_CCF0__NOT_SET 0x00 ///< A match or capture did not occur on channel 0.
#define PCA0CN_CCF0__SET     0x01 ///< A match or capture occurred on channel 0.     
                                                                                     
#define PCA0CN_CCF1__BMASK   0x02 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__SHIFT   0x01 ///< PCA Module 1 Capture/Compare Flag             
#define PCA0CN_CCF1__NOT_SET 0x00 ///< A match or capture did not occur on channel 1.
#define PCA0CN_CCF1__SET     0x02 ///< A match or capture occurred on channel 1.     
                                                                                     
#define PCA0CN_CCF2__BMASK   0x04 ///< PCA Module 2 Capture/Compare Flag             
#define PCA0CN_CCF2__SHIFT   0x02 ///< PCA Module 2 Capture/Compare Flag             
#define PCA0CN_CCF2__NOT_SET 0x00 ///< A match or capture did not occur on channel 2.
#define PCA0CN_CCF2__SET     0x04 ///< A match or capture occurred on channel 2.     
                                                                                     
#define PCA0CN_CR__BMASK     0x40 ///< PCA Counter/Timer Run Control                 
#define PCA0CN_CR__SHIFT     0x06 ///< PCA Counter/Timer Run Control                 
#define PCA0CN_CR__STOP      0x00 ///< Stop the PCA Counter/Timer.                   
#define PCA0CN_CR__RUN       0x40 ///< Start the PCA Counter/Timer running.          
                                                                                     
