ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define P1SKIP_B4__BMASK       0x10 ///< Port 1 Bit 4 Skip                       
#define P1SKIP_B4__SHIFT       0x04 ///< Port 1 Bit 4 Skip                       
#define P1SKIP_B4__NOT_SKIPPED 0x00 ///< P1.4 pin is not skipped by the crossbar.
#define P1SKIP_B4__SKIPPED     0x10 ///< P1.4 pin is skipped by the crossbar.    
                                                                                 
#define P1SKIP_B5__BMASK       0x20 ///< Port 1 Bit 5 Skip                       
#define P1SKIP_B5__SHIFT       0x05 ///< Port 1 Bit 5 Skip                       
#define P1SKIP_B5__NOT_SKIPPED 0x00 ///< P1.5 pin is not skipped by the crossbar.
#define P1SKIP_B5__SKIPPED     0x20 ///< P1.5 pin is skipped by the crossbar.    
                                                                                 
#define P1SKIP_B6__BMASK       0x40 ///< Port 1 Bit 6 Skip                       
#define P1SKIP_B6__SHIFT       0x06 ///< Port 1 Bit 6 Skip                       
#define P1SKIP_B6__NOT_SKIPPED 0x00 ///< P1.6 pin is not skipped by the crossbar.
#define P1SKIP_B6__SKIPPED     0x40 ///< P1.6 pin is skipped by the crossbar.    
                                                                                 
#define P1SKIP_B7__BMASK       0x80 ///< Port 1 Bit 7 Skip                       
#define P1SKIP_B7__SHIFT       0x07 ///< Port 1 Bit 7 Skip                       
#define P1SKIP_B7__NOT_SKIPPED 0x00 ///< P1.7 pin is not skipped by the crossbar.
#define P1SKIP_B7__SKIPPED     0x80 ///< P1.7 pin is skipped by the crossbar.    
                                                                                 
//------------------------------------------------------------------------------
// P2 Enums (Port 2 Pin Latch @ 0xA0)
//------------------------------------------------------------------------------
#define P2_B0__BMASK 0x01 ///< Port 2 Bit 0 Latch                            
#define P2_B0__SHIFT 0x00 ///< Port 2 Bit 0 Latch                            
#define P2_B0__LOW   0x00 ///< P2.0 is low. Set P2.0 to drive low.           
#define P2_B0__HIGH  0x01 ///< P2.0 is high. Set P2.0 to drive or float high.
                                                                             
#define P2_B1__BMASK 0x02 ///< Port 2 Bit 1 Latch                            
#define P2_B1__SHIFT 0x01 ///< Port 2 Bit 1 Latch                            
#define P2_B1__LOW   0x00 ///< P2.1 is low. Set P2.1 to drive low.           
#define P2_B1__HIGH  0x02 ///< P2.1 is high. Set P2.1 to drive or float high.
                                                                             
#define P2_B2__BMASK 0x04 ///< Port 2 Bit 2 Latch                            
#define P2_B2__SHIFT 0x02 ///< Port 2 Bit 2 Latch                            
#define P2_B2__LOW   0x00 ///< P2.2 is low. Set P2.2 to drive low.           
#define P2_B2__HIGH  0x04 ///< P2.2 is high. Set P2.2 to drive or float high.
                                                                             
#define P2_B3__BMASK 0x08 ///< Port 2 Bit 3 Latch                            
#define P2_B3__SHIFT 0x03 ///< Port 2 Bit 3 Latch                            
#define P2_B3__LOW   0x00 ///< P2.3 is low. Set P2.3 to drive low.           
#define P2_B3__HIGH  0x08 ///< P2.3 is high. Set P2.3 to drive or float high.
                                                                             
#define P2_B4__BMASK 0x10 ///< Port 2 Bit 4 Latch                            
#define P2_B4__SHIFT 0x04 ///< Port 2 Bit 4 Latch                            
#define P2_B4__LOW   0x00 ///< P2.4 is low. Set P2.4 to drive low.           
#define P2_B4__HIGH  0x10 ///< P2.4 is high. Set P2.4 to drive or float high.
                                                                             
#define P2_B5__BMASK 0x20 ///< Port 2 Bit 5 Latch                            
#define P2_B5__SHIFT 0x05 ///< Port 2 Bit 5 Latch                            
#define P2_B5__LOW   0x00 ///< P2.5 is low. Set P2.5 to drive low.           
#define P2_B5__HIGH  0x20 ///< P2.5 is high. Set P2.5 to drive or float high.
                                                                             
#define P2_B6__BMASK 0x40 ///< Port 2 Bit 6 Latch                            
#define P2_B6__SHIFT 0x06 ///< Port 2 Bit 6 Latch                            
#define P2_B6__LOW   0x00 ///< P2.6 is low. Set P2.6 to drive low.           
#define P2_B6__HIGH  0x40 ///< P2.6 is high. Set P2.6 to drive or float high.
                                                                             
#define P2_B7__BMASK 0x80 ///< Port 2 Bit 7 Latch                            
#define P2_B7__SHIFT 0x07 ///< Port 2 Bit 7 Latch                            
#define P2_B7__LOW   0x00 ///< P2.7 is low. Set P2.7 to drive low.           
#define P2_B7__HIGH  0x80 ///< P2.7 is high. Set P2.7 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P2DRV Enums (Port 2 Drive Strength @ 0x9B)
//------------------------------------------------------------------------------
#define P2DRV_B0__BMASK      0x01 ///< Port 2 Bit 0 Drive Strength                
#define P2DRV_B0__SHIFT      0x00 ///< Port 2 Bit 0 Drive Strength                
#define P2DRV_B0__LOW_DRIVE  0x00 ///< P2.0 output has low output drive strength. 
#define P2DRV_B0__HIGH_DRIVE 0x01 ///< P2.0 output has high output drive strength.
                                                                                  
#define P2DRV_B1__BMASK      0x02 ///< Port 2 Bit 1 Drive Strength                
#define P2DRV_B1__SHIFT      0x01 ///< Port 2 Bit 1 Drive Strength                
#define P2DRV_B1__LOW_DRIVE  0x00 ///< P2.1 output has low output drive strength. 
#define P2DRV_B1__HIGH_DRIVE 0x02 ///< P2.1 output has high output drive strength.
                                                                                  
#define P2DRV_B2__BMASK      0x04 ///< Port 2 Bit 2 Drive Strength                
#define P2DRV_B2__SHIFT      0x02 ///< Port 2 Bit 2 Drive Strength                
#define P2DRV_B2__LOW_DRIVE  0x00 ///< P2.2 output has low output drive strength. 
#define P2DRV_B2__HIGH_DRIVE 0x04 ///< P2.2 output has high output drive strength.
                                                                                  
#define P2DRV_B3__BMASK      0x08 ///< Port 2 Bit 3 Drive Strength                
#define P2DRV_B3__SHIFT      0x03 ///< Port 2 Bit 3 Drive Strength                
#define P2DRV_B3__LOW_DRIVE  0x00 ///< P2.3 output has low output drive strength. 
#define P2DRV_B3__HIGH_DRIVE 0x08 ///< P2.3 output has high output drive strength.
                                                                                  
#define P2DRV_B4__BMASK      0x10 ///< Port 2 Bit 4 Drive Strength                
#define P2DRV_B4__SHIFT      0x04 ///< Port 2 Bit 4 Drive Strength                
#define P2DRV_B4__LOW_DRIVE  0x00 ///< P2.4 output has low output drive strength. 
#define P2DRV_B4__HIGH_DRIVE 0x10 ///< P2.4 output has high output drive strength.
                                                                                  
#define P2DRV_B5__BMASK      0x20 ///< Port 2 Bit 5 Drive Strength                
#define P2DRV_B5__SHIFT      0x05 ///< Port 2 Bit 5 Drive Strength                
#define P2DRV_B5__LOW_DRIVE  0x00 ///< P2.5 output has low output drive strength. 
#define P2DRV_B5__HIGH_DRIVE 0x20 ///< P2.5 output has high output drive strength.
                                                                                  
#define P2DRV_B6__BMASK      0x40 ///< Port 2 Bit 6 Drive Strength                
#define P2DRV_B6__SHIFT      0x06 ///< Port 2 Bit 6 Drive Strength                
#define P2DRV_B6__LOW_DRIVE  0x00 ///< P2.6 output has low output drive strength. 
#define P2DRV_B6__HIGH_DRIVE 0x40 ///< P2.6 output has high output drive strength.
                                                                                  
#define P2DRV_B7__BMASK      0x80 ///< Port 2 Bit 7 Drive Strength                
#define P2DRV_B7__SHIFT      0x07 ///< Port 2 Bit 7 Drive Strength                
#define P2DRV_B7__LOW_DRIVE  0x00 ///< P2.7 output has low output drive strength. 
#define P2DRV_B7__HIGH_DRIVE 0x80 ///< P2.7 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P2MASK Enums (Port 2 Mask @ 0x84)
//------------------------------------------------------------------------------
#define P2MASK_B0__BMASK    0x01 ///< Port 2 Bit 0 Mask Value                           
#define P2MASK_B0__SHIFT    0x00 ///< Port 2 Bit 0 Mask Value                           
#define P2MASK_B0__IGNORED  0x00 ///< P2.0 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B0__COMPARED 0x01 ///< P2.0 pin logic value is compared to P2MAT.0.      
                                                                                        
#define P2MASK_B1__BMASK    0x02 ///< Port 2 Bit 1 Mask Value                           
#define P2MASK_B1__SHIFT    0x01 ///< Port 2 Bit 1 Mask Value                           
#define P2MASK_B1__IGNORED  0x00 ///< P2.1 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B1__COMPARED 0x02 ///< P2.1 pin logic value is compared to P2MAT.1.      
                                                                                        
#define P2MASK_B2__BMASK    0x04 ///< Port 2 Bit 2 Mask Value                           
#define P2MASK_B2__SHIFT    0x02 ///< Port 2 Bit 2 Mask Value                           
#define P2MASK_B2__IGNORED  0x00 ///< P2.2 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P2MASK_B2__COMPARED 0x04 ///< P2.2 pin logic value is compared to P2MAT.2.      
                                                                                        
