ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define P4_B5__BMASK 0x20 ///< Port 4 Bit 5 Latch                            
#define P4_B5__SHIFT 0x05 ///< Port 4 Bit 5 Latch                            
#define P4_B5__LOW   0x00 ///< P4.5 is low. Set P4.5 to drive low.           
#define P4_B5__HIGH  0x20 ///< P4.5 is high. Set P4.5 to drive or float high.
                                                                             
#define P4_B6__BMASK 0x40 ///< Port 4 Bit 6 Latch                            
#define P4_B6__SHIFT 0x06 ///< Port 4 Bit 6 Latch                            
#define P4_B6__LOW   0x00 ///< P4.6 is low. Set P4.6 to drive low.           
#define P4_B6__HIGH  0x40 ///< P4.6 is high. Set P4.6 to drive or float high.
                                                                             
#define P4_B7__BMASK 0x80 ///< Port 4 Bit 7 Latch                            
#define P4_B7__SHIFT 0x07 ///< Port 4 Bit 7 Latch                            
#define P4_B7__LOW   0x00 ///< P4.7 is low. Set P4.7 to drive low.           
#define P4_B7__HIGH  0x80 ///< P4.7 is high. Set P4.7 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P4DRV Enums (Port 4 Drive Strength @ 0xB9)
//------------------------------------------------------------------------------
#define P4DRV_B0__BMASK      0x01 ///< Port 4 Bit 0 Drive Strength                
#define P4DRV_B0__SHIFT      0x00 ///< Port 4 Bit 0 Drive Strength                
#define P4DRV_B0__LOW_DRIVE  0x00 ///< P4.0 output has low output drive strength. 
#define P4DRV_B0__HIGH_DRIVE 0x01 ///< P4.0 output has high output drive strength.
                                                                                  
#define P4DRV_B1__BMASK      0x02 ///< Port 4 Bit 1 Drive Strength                
#define P4DRV_B1__SHIFT      0x01 ///< Port 4 Bit 1 Drive Strength                
#define P4DRV_B1__LOW_DRIVE  0x00 ///< P4.1 output has low output drive strength. 
#define P4DRV_B1__HIGH_DRIVE 0x02 ///< P4.1 output has high output drive strength.
                                                                                  
#define P4DRV_B2__BMASK      0x04 ///< Port 4 Bit 2 Drive Strength                
#define P4DRV_B2__SHIFT      0x02 ///< Port 4 Bit 2 Drive Strength                
#define P4DRV_B2__LOW_DRIVE  0x00 ///< P4.2 output has low output drive strength. 
#define P4DRV_B2__HIGH_DRIVE 0x04 ///< P4.2 output has high output drive strength.
                                                                                  
#define P4DRV_B3__BMASK      0x08 ///< Port 4 Bit 3 Drive Strength                
#define P4DRV_B3__SHIFT      0x03 ///< Port 4 Bit 3 Drive Strength                
#define P4DRV_B3__LOW_DRIVE  0x00 ///< P4.3 output has low output drive strength. 
#define P4DRV_B3__HIGH_DRIVE 0x08 ///< P4.3 output has high output drive strength.
                                                                                  
#define P4DRV_B4__BMASK      0x10 ///< Port 4 Bit 4 Drive Strength                
#define P4DRV_B4__SHIFT      0x04 ///< Port 4 Bit 4 Drive Strength                
#define P4DRV_B4__LOW_DRIVE  0x00 ///< P4.4 output has low output drive strength. 
#define P4DRV_B4__HIGH_DRIVE 0x10 ///< P4.4 output has high output drive strength.
                                                                                  
#define P4DRV_B5__BMASK      0x20 ///< Port 4 Bit 5 Drive Strength                
#define P4DRV_B5__SHIFT      0x05 ///< Port 4 Bit 5 Drive Strength                
#define P4DRV_B5__LOW_DRIVE  0x00 ///< P4.5 output has low output drive strength. 
#define P4DRV_B5__HIGH_DRIVE 0x20 ///< P4.5 output has high output drive strength.
                                                                                  
#define P4DRV_B6__BMASK      0x40 ///< Port 4 Bit 6 Drive Strength                
#define P4DRV_B6__SHIFT      0x06 ///< Port 4 Bit 6 Drive Strength                
#define P4DRV_B6__LOW_DRIVE  0x00 ///< P4.6 output has low output drive strength. 
#define P4DRV_B6__HIGH_DRIVE 0x40 ///< P4.6 output has high output drive strength.
                                                                                  
#define P4DRV_B7__BMASK      0x80 ///< Port 4 Bit 7 Drive Strength                
#define P4DRV_B7__SHIFT      0x07 ///< Port 4 Bit 7 Drive Strength                
#define P4DRV_B7__LOW_DRIVE  0x00 ///< P4.7 output has low output drive strength. 
#define P4DRV_B7__HIGH_DRIVE 0x80 ///< P4.7 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P4MDIN Enums (Port 4 Input Mode @ 0xF1)
//------------------------------------------------------------------------------
#define P4MDIN_B0__BMASK   0x01 ///< Port 4 Bit 0 Input Mode                 
#define P4MDIN_B0__SHIFT   0x00 ///< Port 4 Bit 0 Input Mode                 
#define P4MDIN_B0__ANALOG  0x00 ///< P4.0 pin is configured for analog mode. 
#define P4MDIN_B0__DIGITAL 0x01 ///< P4.0 pin is configured for digital mode.
                                                                             
#define P4MDIN_B1__BMASK   0x02 ///< Port 4 Bit 1 Input Mode                 
#define P4MDIN_B1__SHIFT   0x01 ///< Port 4 Bit 1 Input Mode                 
#define P4MDIN_B1__ANALOG  0x00 ///< P4.1 pin is configured for analog mode. 
#define P4MDIN_B1__DIGITAL 0x02 ///< P4.1 pin is configured for digital mode.
                                                                             
#define P4MDIN_B2__BMASK   0x04 ///< Port 4 Bit 2 Input Mode                 
#define P4MDIN_B2__SHIFT   0x02 ///< Port 4 Bit 2 Input Mode                 
#define P4MDIN_B2__ANALOG  0x00 ///< P4.2 pin is configured for analog mode. 
#define P4MDIN_B2__DIGITAL 0x04 ///< P4.2 pin is configured for digital mode.
                                                                             
#define P4MDIN_B3__BMASK   0x08 ///< Port 4 Bit 3 Input Mode                 
#define P4MDIN_B3__SHIFT   0x03 ///< Port 4 Bit 3 Input Mode                 
#define P4MDIN_B3__ANALOG  0x00 ///< P4.3 pin is configured for analog mode. 
#define P4MDIN_B3__DIGITAL 0x08 ///< P4.3 pin is configured for digital mode.
                                                                             
#define P4MDIN_B4__BMASK   0x10 ///< Port 4 Bit 4 Input Mode                 
#define P4MDIN_B4__SHIFT   0x04 ///< Port 4 Bit 4 Input Mode                 
#define P4MDIN_B4__ANALOG  0x00 ///< P4.4 pin is configured for analog mode. 
#define P4MDIN_B4__DIGITAL 0x10 ///< P4.4 pin is configured for digital mode.
                                                                             
