ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define P4MDIN_B5__BMASK   0x20 ///< Port 4 Bit 5 Input Mode                 
#define P4MDIN_B5__SHIFT   0x05 ///< Port 4 Bit 5 Input Mode                 
#define P4MDIN_B5__ANALOG  0x00 ///< P4.5 pin is configured for analog mode. 
#define P4MDIN_B5__DIGITAL 0x20 ///< P4.5 pin is configured for digital mode.
                                                                             
#define P4MDIN_B6__BMASK   0x40 ///< Port 4 Bit 6 Input Mode                 
#define P4MDIN_B6__SHIFT   0x06 ///< Port 4 Bit 6 Input Mode                 
#define P4MDIN_B6__ANALOG  0x00 ///< P4.6 pin is configured for analog mode. 
#define P4MDIN_B6__DIGITAL 0x40 ///< P4.6 pin is configured for digital mode.
                                                                             
#define P4MDIN_B7__BMASK   0x80 ///< Port 4 Bit 7 Input Mode                 
#define P4MDIN_B7__SHIFT   0x07 ///< Port 4 Bit 7 Input Mode                 
#define P4MDIN_B7__ANALOG  0x00 ///< P4.7 pin is configured for analog mode. 
#define P4MDIN_B7__DIGITAL 0x80 ///< P4.7 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P4MDOUT Enums (Port 4 Output Mode @ 0xC3)
//------------------------------------------------------------------------------
#define P4MDOUT_B0__BMASK      0x01 ///< Port 4 Bit 0 Output Mode  
#define P4MDOUT_B0__SHIFT      0x00 ///< Port 4 Bit 0 Output Mode  
#define P4MDOUT_B0__OPEN_DRAIN 0x00 ///< P4.0 output is open-drain.
#define P4MDOUT_B0__PUSH_PULL  0x01 ///< P4.0 output is push-pull. 
                                                                   
#define P4MDOUT_B1__BMASK      0x02 ///< Port 4 Bit 1 Output Mode  
#define P4MDOUT_B1__SHIFT      0x01 ///< Port 4 Bit 1 Output Mode  
#define P4MDOUT_B1__OPEN_DRAIN 0x00 ///< P4.1 output is open-drain.
#define P4MDOUT_B1__PUSH_PULL  0x02 ///< P4.1 output is push-pull. 
                                                                   
#define P4MDOUT_B2__BMASK      0x04 ///< Port 4 Bit 2 Output Mode  
#define P4MDOUT_B2__SHIFT      0x02 ///< Port 4 Bit 2 Output Mode  
#define P4MDOUT_B2__OPEN_DRAIN 0x00 ///< P4.2 output is open-drain.
#define P4MDOUT_B2__PUSH_PULL  0x04 ///< P4.2 output is push-pull. 
                                                                   
#define P4MDOUT_B3__BMASK      0x08 ///< Port 4 Bit 3 Output Mode  
#define P4MDOUT_B3__SHIFT      0x03 ///< Port 4 Bit 3 Output Mode  
#define P4MDOUT_B3__OPEN_DRAIN 0x00 ///< P4.3 output is open-drain.
#define P4MDOUT_B3__PUSH_PULL  0x08 ///< P4.3 output is push-pull. 
                                                                   
#define P4MDOUT_B4__BMASK      0x10 ///< Port 4 Bit 4 Output Mode  
#define P4MDOUT_B4__SHIFT      0x04 ///< Port 4 Bit 4 Output Mode  
#define P4MDOUT_B4__OPEN_DRAIN 0x00 ///< P4.4 output is open-drain.
#define P4MDOUT_B4__PUSH_PULL  0x10 ///< P4.4 output is push-pull. 
                                                                   
#define P4MDOUT_B5__BMASK      0x20 ///< Port 4 Bit 5 Output Mode  
#define P4MDOUT_B5__SHIFT      0x05 ///< Port 4 Bit 5 Output Mode  
#define P4MDOUT_B5__OPEN_DRAIN 0x00 ///< P4.5 output is open-drain.
#define P4MDOUT_B5__PUSH_PULL  0x20 ///< P4.5 output is push-pull. 
                                                                   
#define P4MDOUT_B6__BMASK      0x40 ///< Port 4 Bit 6 Output Mode  
#define P4MDOUT_B6__SHIFT      0x06 ///< Port 4 Bit 6 Output Mode  
#define P4MDOUT_B6__OPEN_DRAIN 0x00 ///< P4.6 output is open-drain.
#define P4MDOUT_B6__PUSH_PULL  0x40 ///< P4.6 output is push-pull. 
                                                                   
#define P4MDOUT_B7__BMASK      0x80 ///< Port 4 Bit 7 Output Mode  
#define P4MDOUT_B7__SHIFT      0x07 ///< Port 4 Bit 7 Output Mode  
#define P4MDOUT_B7__OPEN_DRAIN 0x00 ///< P4.7 output is open-drain.
#define P4MDOUT_B7__PUSH_PULL  0x80 ///< P4.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P5 Enums (Port 5 Pin Latch @ 0xE3)
//------------------------------------------------------------------------------
#define P5_B0__BMASK 0x01 ///< Port 5 Bit 0 Latch                            
#define P5_B0__SHIFT 0x00 ///< Port 5 Bit 0 Latch                            
#define P5_B0__LOW   0x00 ///< P5.0 is low. Set P5.0 to drive low.           
#define P5_B0__HIGH  0x01 ///< P5.0 is high. Set P5.0 to drive or float high.
                                                                             
#define P5_B1__BMASK 0x02 ///< Port 5 Bit 1 Latch                            
#define P5_B1__SHIFT 0x01 ///< Port 5 Bit 1 Latch                            
#define P5_B1__LOW   0x00 ///< P5.1 is low. Set P5.1 to drive low.           
#define P5_B1__HIGH  0x02 ///< P5.1 is high. Set P5.1 to drive or float high.
                                                                             
#define P5_B2__BMASK 0x04 ///< Port 5 Bit 2 Latch                            
#define P5_B2__SHIFT 0x02 ///< Port 5 Bit 2 Latch                            
#define P5_B2__LOW   0x00 ///< P5.2 is low. Set P5.2 to drive low.           
#define P5_B2__HIGH  0x04 ///< P5.2 is high. Set P5.2 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P5DRV Enums (Port 5 Drive Strength @ 0x9D)
//------------------------------------------------------------------------------
#define P5DRV_B0__BMASK      0x01 ///< Port 5 Bit 0 Drive Strength                
#define P5DRV_B0__SHIFT      0x00 ///< Port 5 Bit 0 Drive Strength                
#define P5DRV_B0__LOW_DRIVE  0x00 ///< P5.0 output has low output drive strength. 
#define P5DRV_B0__HIGH_DRIVE 0x01 ///< P5.0 output has high output drive strength.
                                                                                  
#define P5DRV_B1__BMASK      0x02 ///< Port 5 Bit 1 Drive Strength                
#define P5DRV_B1__SHIFT      0x01 ///< Port 5 Bit 1 Drive Strength                
#define P5DRV_B1__LOW_DRIVE  0x00 ///< P5.1 output has low output drive strength. 
#define P5DRV_B1__HIGH_DRIVE 0x02 ///< P5.1 output has high output drive strength.
                                                                                  
