ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Register_Enums.h
#define P5DRV_B2__BMASK      0x04 ///< Port 5 Bit 2 Drive Strength                
#define P5DRV_B2__SHIFT      0x02 ///< Port 5 Bit 2 Drive Strength                
#define P5DRV_B2__LOW_DRIVE  0x00 ///< P5.2 output has low output drive strength. 
#define P5DRV_B2__HIGH_DRIVE 0x04 ///< P5.2 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P5MDIN Enums (Port 5 Input Mode @ 0xF2)
//------------------------------------------------------------------------------
#define P5MDIN_B0__BMASK   0x01 ///< Port 5 Bit 0 Input Mode                 
#define P5MDIN_B0__SHIFT   0x00 ///< Port 5 Bit 0 Input Mode                 
#define P5MDIN_B0__ANALOG  0x00 ///< P5.0 pin is configured for analog mode. 
#define P5MDIN_B0__DIGITAL 0x01 ///< P5.0 pin is configured for digital mode.
                                                                             
#define P5MDIN_B1__BMASK   0x02 ///< Port 5 Bit 1 Input Mode                 
#define P5MDIN_B1__SHIFT   0x01 ///< Port 5 Bit 1 Input Mode                 
#define P5MDIN_B1__ANALOG  0x00 ///< P5.1 pin is configured for analog mode. 
#define P5MDIN_B1__DIGITAL 0x02 ///< P5.1 pin is configured for digital mode.
                                                                             
#define P5MDIN_B2__BMASK   0x04 ///< Port 5 Bit 2 Input Mode                 
#define P5MDIN_B2__SHIFT   0x02 ///< Port 5 Bit 2 Input Mode                 
#define P5MDIN_B2__ANALOG  0x00 ///< P5.2 pin is configured for analog mode. 
#define P5MDIN_B2__DIGITAL 0x04 ///< P5.2 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P5MDOUT Enums (Port 5 Output Mode @ 0xFF)
//------------------------------------------------------------------------------
#define P5MDOUT_B0__BMASK      0x01 ///< Port 5 Bit 0 Output Mode  
#define P5MDOUT_B0__SHIFT      0x00 ///< Port 5 Bit 0 Output Mode  
#define P5MDOUT_B0__OPEN_DRAIN 0x00 ///< P5.0 output is open-drain.
#define P5MDOUT_B0__PUSH_PULL  0x01 ///< P5.0 output is push-pull. 
                                                                   
#define P5MDOUT_B1__BMASK      0x02 ///< Port 5 Bit 1 Output Mode  
#define P5MDOUT_B1__SHIFT      0x01 ///< Port 5 Bit 1 Output Mode  
#define P5MDOUT_B1__OPEN_DRAIN 0x00 ///< P5.1 output is open-drain.
#define P5MDOUT_B1__PUSH_PULL  0x02 ///< P5.1 output is push-pull. 
                                                                   
#define P5MDOUT_B2__BMASK      0x04 ///< Port 5 Bit 2 Output Mode  
#define P5MDOUT_B2__SHIFT      0x02 ///< Port 5 Bit 2 Output Mode  
#define P5MDOUT_B2__OPEN_DRAIN 0x00 ///< P5.2 output is open-drain.
#define P5MDOUT_B2__PUSH_PULL  0x04 ///< P5.2 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P6 Enums (Port 6 Pin Latch @ 0xE4)
//------------------------------------------------------------------------------
#define P6_B0__BMASK 0x01 ///< Port 6 Bit 0 Latch                            
#define P6_B0__SHIFT 0x00 ///< Port 6 Bit 0 Latch                            
#define P6_B0__LOW   0x00 ///< P6.0 is low. Set P6.0 to drive low.           
#define P6_B0__HIGH  0x01 ///< P6.0 is high. Set P6.0 to drive or float high.
                                                                             
#define P6_B1__BMASK 0x02 ///< Port 6 Bit 1 Latch                            
#define P6_B1__SHIFT 0x01 ///< Port 6 Bit 1 Latch                            
#define P6_B1__LOW   0x00 ///< P6.1 is low. Set P6.1 to drive low.           
#define P6_B1__HIGH  0x02 ///< P6.1 is high. Set P6.1 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P6MDIN Enums (Port 6 Input Mode @ 0x97)
//------------------------------------------------------------------------------
#define P6MDIN_B0__BMASK   0x01 ///< Port 6 Bit 0 Input Mode                 
#define P6MDIN_B0__SHIFT   0x00 ///< Port 6 Bit 0 Input Mode                 
#define P6MDIN_B0__ANALOG  0x00 ///< P6.0 pin is configured for analog mode. 
#define P6MDIN_B0__DIGITAL 0x01 ///< P6.0 pin is configured for digital mode.
                                                                             
#define P6MDIN_B1__BMASK   0x02 ///< Port 6 Bit 1 Input Mode                 
#define P6MDIN_B1__SHIFT   0x01 ///< Port 6 Bit 1 Input Mode                 
#define P6MDIN_B1__ANALOG  0x00 ///< P6.1 pin is configured for analog mode. 
#define P6MDIN_B1__DIGITAL 0x02 ///< P6.1 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// RSTSRC Enums (Reset Source @ 0xEF)
//------------------------------------------------------------------------------
#define RSTSRC_PINRSF__BMASK   0x01 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__SHIFT   0x00 ///< HW Pin Reset Flag                                                    
#define RSTSRC_PINRSF__NOT_SET 0x00 ///< The /RST pin did not cause the last reset.                           
#define RSTSRC_PINRSF__SET     0x01 ///< The /RST pin caused the last reset.                                  
                                                                                                              
#define RSTSRC_PORSF__BMASK    0x02 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__SHIFT    0x01 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__NOT_SET  0x00 ///< A power-on or supply monitor reset did not occur.                    
#define RSTSRC_PORSF__SET      0x02 ///< A power-on or supply monitor reset occurred.                         
                                                                                                              
